# region Домашка: ************************************************************


# endregion Домашка: ************************************************************


# region Урок: ******************************************************************

# Тип 1 №58468

from itertools import permutations
graph = 'АБ БА АИ ИА БИ ИБ БВ ВБ ВЖ ЖВ ЖБ БЖ ИЖ ЖИ ЖЕ ЕЖ ЕД ДЕ ГД ДГ ЕГ ГЕ ВГ ГВ'
table = '14 17 18 23 25 26 32 34 38 41 43 47 48 52 56 58 62 65 71 74 81 83 84 85'
for per in permutations('АБВГДЖЕИ'):
    new_table = table
    for i in range(1, 8+1):
        new_table = new_table.replace(str(i), per[i-1])
    if set(new_table.split()) == set(graph.split()):
        print('1 2 3 4 5 6 7 8')
        print(*per)


# endregion Урок: ***************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************


# Сева = [1, 2, 6, 5, 8, 9, 12, 14, 15, 16, 17, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:
