# region Домашка: ************************************************************

# КЕГЭ № 594 (Уровень: Средний)
# Алгоритм вычисления функций F(n) и G(n) задан следующими соотношениями:
# F(n) = G(n) = 1 при n=1
# F(n) = F(n−1) + 3⋅G(n−1) при n>1
# G(n) = F(n−1) − 2⋅G(n−1) при n>1
#
# Чему равна сумма цифр значения функции F(18)?
'''
def F(n):
    if n == 1:
        return 1
    if n > 1:
        return F(n-1) + 3 * G(n-1)

def G(n):
    if n == 1:
        return 1
    if n > 1:
        return F(n-1) - 2 * G(n-1)


n = F(18)
print(sum([int(x) for x in str(n) if x.isdigit()]))  # 18298549
'''
# endregion Домашка: ************************************************************


# region Урок: ******************************************************************

# Тип 15 №27303
# Для какого наименьшего целого неотрицательного числа А выражение
# (4x + 3y < A) ∨ (x ≥ y) ∨ (y ≥ 13)
#
# тождественно истинно, т. е. принимает значение 1 при любых целых неотрицательных x и y?
'''
def F(x, y, A):
    return (4*x + 3*y < A) or (x >= y) or (y >= 13)


for A in range(0, 1000):
    flag = True
    for x in range(0, 100):
        for y in range(0, 100):
            if F(x, y, A) == False:
                flag = False
                break
    if flag == True:
        print(A)
        break


# Вариант 2
def F(x, y, A):
    return (4*x + 3*y < A) or (x >= y) or (y >= 13)

for A in range(0, 1000):
    if all(F(x, y, A) for x in range(0, 100) for y in range(0, 100)):
        print(A)
        break


def F(x, y, A):
    return (4*x + 3*y < A) or (x >= y) or (y >= 13)

R = []
for A in range(0, 1000):
    if all(F(x, y, A) for x in range(0, 100) for y in range(0, 100)):
        R.append(A)
print(min(R))


# Вариант 3
print(min([A for A in range(0, 1000) if all( ((4*x + 3*y < A) or (x >= y) or (y >= 13)) for x in range(0, 100) for y in range(0, 100))]))
'''


# Тип 15 №33517
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».
# Для какого наибольшего натурального числа А формула
# ДЕЛ(70, A) ∧ (ДЕЛ(x, 28) → (¬ДЕЛ(x, А) → ¬ДЕЛ(x, 21)))
# тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной x)?
'''
def F(x, A):
    return (70 % A == 0) and ((x % 28 == 0) <= ((x % A != 0) <= (x % 21 != 0)))

R = []
for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        R.append(A)
print(max(R))
'''


# Тип 15 №34521
# Для какого наибольшего целого числа А формула
# x&51 = 0 ∨ (x&41 = 0 → x&А = 0)
# тождественно истинна (т. е. принимает значение 1 при любом неотрицательном целом значении переменной x)?
'''
def F(x, A):
    return (x&51 == 0) or ((x&41 == 0) <= (x&A == 0))


R = []
for A in range(0, 10000):
    if all(F(x, A) for x in range(0, 10000)):
        R.append(A)
print(max(R))
'''

# Тип 15 №9170
# На числовой прямой даны два отрезка: P = [10, 35] и Q = [17, 48].
# Укажите наибольшую возможную длину отрезка A, для которого формула
# ((x ∈ A) → ¬(x ∈ P)) → ((x ∈ A) → (x ∈ Q))
# тождественно истинна, то есть принимает значение 1 при любом значении переменной х.
'''
def F(x, a1, a2):
    Q = 17 <= x <= 48
    P = 10 <= x <= 35
    A = a1 <= x <= a2
    return (A <= (not P)) <= (A <= Q)


R = []
M = [x / 4 for x in range(5*4, 55*4)]
print(M)
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2-a1)
print(max(R))
'''
# Ответ: 38.0 -> 38


# Тип 15 №9699
# На числовой прямой даны два отрезка: P = [4, 15] и Q = [12, 20].
# Укажите наименьшую возможную длину отрезка A, для которого выражение
# ((x ∈ P) ∧ (x ∈ Q)) → (x ∈ A)
# тождественно истинно, то есть принимает значение 1 при любом значении переменной х.
'''
def F(x, a1, a2):
    Q = 4 <= x <= 15
    P = 12 <= x <= 20
    A = a1 <= x <= a2
    return (P and Q) <= A


R = []
M = [x / 4 for x in range(0*4, 30*4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2-a1)
print(min(R))
'''
# Ответ: 3


# Тип 15 №7763
# На числовой прямой даны два отрезка: P = [5, 30] и Q = [14, 23].
# Укажите наибольшую возможную длину промежутка A, для которого формула
# ((x ∈ P) ≡ (x ∈ Q)) → ¬(x ∈ A)
# тождественно истинна, то есть принимает значение 1 при любом значении переменной х.

def F(x, a1, a2):
    Q = 5 <= x <= 30
    P = 14 <= x <= 23
    A = a1 <= x <= a2
    return (P == Q) <= (not A)


R = []
M = [x / 10 for x in range(0*10, 35*10)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2-a1)
print(max(R))

# 8.75 -> 8.9 -> Ответ: 9

# endregion Урок: ***************************************************************


# Сева = [2.1, 6.1, 5.1, 8.1, 12.1, 14.1, 15.1, 16.1, 23.1]
# КЕГЭ  = []
# на следующем уроке:
