
# region Домашка: ******************************************************************
'''
a = int(input())
b = int(input())
print(f'{a} + {b} = {a + b}')
print(f'{a} - {b} = {a - b}')
e = a * b
f = a % b
print(a, "*", b, '=', e)
print(a, "%", b, '=', f)
'''

'''
x = int(input())  # 768
a = x // 100
b = (x % 100) // 10
c = x % 10
print(f'Сумма цифр = {a + b + c}')
print('Произведение цифр =', a * c * b)
'''

'''
a = int(input())
b = int(input())
c = int(input())
print(f'{a + b + c}')
'''
# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# Как работать с функцией print()
# Задача написать текст: "Сегодня отличная погода - облачно, а температура 24 градуса!"
'''
weather = 'облачно'  # str()
temperature = int(input('Введите температуру: '))  # int()
print("Сегодня отличная", weather, "- облачно, а температура", temperature, "градуса!")
print("Сегодня отличная " + weather + " - облачно, а температура " + str(temperature) + " градуса!")
print("Сегодня отличная {} - облачно, а температура {} градуса!".format(weather, temperature))
print(f"Сегодня отличная {weather} - облачно, а температура {temperature} градуса!")
# TypeError: can only concatenate str (not "int") to str
'''


# Базовая арифметика Пайтон
'''
print(f'Прочитал книжку "Война и мир" ')

a = 7
b = 2
print(f'{a} + {b} = {a+b} \n'  # \n символ перехода на новую строчку в консоли
      f'{a} - {b} = {a-b} \n'
      f'{a} * {b} = {a*b}')

print()  # '\n' в пустом принте присутствует

print(f'{a} / {b} = {a/b} - вещественное деление (получает float дробь) \n'  
      f'{a} // {b} = {a//b} - целочисленное деление, только целая часть \n'
      f'Округление по математическим правилам: {a} / {b} = {round(a / b)}\n'
      f'{a} % {b} = {a%b} - остаток от деления (от обыкновенной дроби)')

print()

n = int(input('n: '))
if n % 2 == 0:  # если делится на 2 без остатка, то число n четное
      print('Четное!')
else:
      print('Нечетное')

print()

import math
print(math.sqrt(16))
print(f'Возведите {a} в степень {b}: {a} ** {b} = {a ** b} \n'
      f'Возьмите квадратный корень от числа 16: 16 ** (1/2) = {16 ** (1/2)} \n'
      f'Возьмите кубический корень от числа 27: 27 ** (1/3) = {27 ** (1/3)} ')
'''


# Условные операторы, ветвление: if, elif, else
'''
x = -6
y = -7
if x > 0 and y > 0:  # if - если
      print('1')
elif x < 0 and y > 0:
      print('2')
elif x < 0 and y < 0:  # elif - иначе если
      print('3')
elif x > 0 and y < 0:
      print('4')
else:  # else - иначе
      print('Лежит на осях')
'''

'''
# Не кратен:
x = 7
if x % 2 != 0:
      print('Не кратен 2-ум')
'''

# Логические связки: and, or, not
'''
a = -7
b = -8
if a > 0 and b > 0:
      print('YES 1')
if a > 0 or b > 0:
      print('YES 2')
else:
      print('NO')
'''
# endregion Урок: ******************************************************************


# todo: Лера = []
# todo: КЕГЭ  = []
# на прошлом уроке:
# на следующем уроке:
