
# region Домашка: ******************************************************************

# 1 ((x <= y) and (y <= w)) or (z == (x or y))
# 2 (x == (w or y )) or ((w <= z) and (y <= w))
# 3 ( z and y) or ((x <= z) == (y <= w))
# 4 (( y <= x) == (x <= w)) and (z or x)
# 5 ( x == (not y)) <= (z == (y or w))
# 6 ((x and y) or (y and z)) == ((x <= w) and (w <= z))
# 7 (z and y) or ((x <= z)== (y <= w))
# 8 (x and (not y)) or (y == z) or w
# 9 (( x <= y) == (y <= z)) and (y or w)
# 10 (( y <= x) == (x <= w)) and (z or x)

# ((x → y ) ∧ (y → w)) ∨ (z ≡ ( x ∨ y))
# (x ≡ ( w ∨ y)) ∨ ((w → z ) ∧ (y → w))
# (z ∧ y) ∨ ((x → z ) ≡ (y → w))
# ((y → x) ≡ (x → w)) ∧ (z ∨ x)
# (x≡¬y)→(z≡(y∨w))
# ((x ∧ y) ∨ (y ∧ z)) ≡ ((x → w) ∧ (w → z))
# (z ∧ y) ∨ ((x → z ) ≡ (y → w))
# (x ∧ ¬y) ∨ (y ≡ z ) ∨ w
#  ((x → y) ≡ (y → z)) ∧ (y ∨ w)
# ((y → x) ≡ (x → w)) ∧ (z ∨ x)


# ДЗ номер 6904 КЕГЭ

# F = ¬(((x → y ∧ w) ∧ (z → x ∨ y)) ≡ w)
'''
print('x y z w F')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                F = (not(((x <= (y and w)) and (z <= (x or y))) == w))
                if F:
                    print(x, y, z, w, int(F))
'''


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************


# Тип 6 №59684
# В начальный момент Черепаха находится B начале координат,
# её голова направлена вдоль положительного направления оси ординат,
# хвост опущен.

# Черепахе был дан для исполнения следующий алгоритм:
# Повтори 2 [Вперёд 10 Направо 90 Вперёд 18 Направо 90]
# Поднять хвост
# Вперёд 5 Направо 90 Вперёд 7 Налево 90
# Опустить хвост
# Повтори 2 [Вперёд 10 Направо 90 Вперёд 7 Направо 90]
#
# Определите, сколько точек с целочисленными координатами будут находиться внутри
# объединения фигур, ограниченных заданными алгоритмом линиями, включая точки на линиях.

import turtle as t
t.left(90)
t.down()
t.speed(10)
l = 5

# Повтори 11 [Вперёд 36 Направо 72]
for i in range(11):
    t.forward(36*l)
    t.right(72)

t.done()

# Ответ: 249


'''
import turtle
turtle.down()


turtle.forward(100)

turtle.done()
'''
# endregion Урок: ******************************************************************


# todo: Лера = []
# todo: КЕГЭ  = []
# на прошлом уроке:
# на следующем уроке:
