# region Домашка: ******************************************************************************


# endregion Домашка: ******************************************************************************


# region Урок: ******************************************************************************

# 25 Номер вариант Лени и Марата 13
'''
from fnmatch import *
for x in range(5*(10**5), 10**6):
    my_set = set()
    for j in range(1, int(x ** 0.5) + 1):
        if x % j == 0:
            if fnmatch(str(j), '*0') and len(str(j)) == 4:
                my_set.add(j)
            if fnmatch(str(x // j), '*0') and len(str(x // j)) == 4:
                my_set.add(x // j)
    if len(my_set) > 45:
        print(x, len(my_set))
'''


# endregion Урок: ******************************************************************************

import useful
print(useful.Who_Is_Name())

# todo:    Александр2   = [1, 2, 3, 4, 5, 6, 7, 8, 9.1, 11, 12, 14+, 15+, 16, 17, 18, 19-21, 23, 24, 25.2]
# todo: Александр2 КЕГЭ = [9, 15, 17, 24]
# на прошлом уроке: Прорешали номера с домашки: 6, письменные 16 и 17
# на следующем уроке:
