# region Домашка: ******************************************************************************




# endregion Домашка: ******************************************************************************


# region Урок: ******************************************************************************



# endregion Урок: ******************************************************************************

import useful
print(useful.who_is_name())
# todo: Александр_2 = [1, 2, 3, 4, 5, 6, 8, 9.1, 12, 14+, 15+, 16, 17, 18, 19-21, 23, 24, 25.2]
# на прошлом уроке: Прорешивали 24, 5, 15, 9 номера - практиковались на интересных задачах.
# на следующем уроке:







