# region Домашка: ******************************************************************************




# endregion Домашка: ******************************************************************************


# region Урок: ******************************************************************************

# Тип 2 № 39231
# Логическая функция F задаётся выражением (¬z ≡ y) → ((w ∧ ¬x) ≡ (y ∧ x)).
# На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки.
# Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.


print('x y z w')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                # F = ((not z) == y) <= ((w and (not x)) == (y and x))  # 39231
                F = ((not x) or y or z) == ((not y) and z and w)  # 27228
                if F == True:
                    print(x, y, z, w)



# endregion Урок: ******************************************************************************


# todo: Александр_2 = [2, 3, 5, 6, 8, 9.1, 12, 14+, 15+, 16, 17, 18, 19-21, 23, 24, 25.2]
# на прошлом уроке: Добивали 18 номер, решали задачи на столбец чисел, энергию - стенки и ладью.
# на следующем уроке:







