# region Домашка: ******************************************************************************




# endregion Домашка: ******************************************************************************


# region Урок: ******************************************************************************




# endregion Урок: ******************************************************************************


# todo: Александр_2 = [2, 3, 5, 6, 8, 9.1, 12, 14+, 15+, 16, 17, 19-21, 23, 24, 25.2]
# на прошлом уроке:  Разбирали 18 номера, почти всех типов, кроме ладьи и столбиков.
# на следующем уроке: 18 номер задачи на ладью, и столбики







