# На следующем уроке: Арифметика с переменными, функция print(), sep и end


# Одностройчный комментарий

'''
Многострочный комментарий
'''




# Типы данных
#print(4, type(4))
#print('4', type('4'))

# Типы данных переменных
'''

a = 4  # int (integer) - целочисленные значения

b = '4'  # str (string) -  строковый тип данных, хранит слова6 буквы, цифры

c = 4.5  # float (число с плавающей точкой) - вещественные числа (дроби)

d1 = True  # bool (boolean) - элементы Булевой алгебры, математическая логика
d2 = False
print(4 < 10)
'''

# Корветация типов данных
'''
x = 5
print(x, type(x))

x = str(x)  # новый x равен старые перевести в строку
print(x, type(x))

x = float(x)
print(x, type(x))

x = int(x)
print(x, type(x))
'''

# Ввод данных с клавиатуры
'''
name = input('Name: ')  # функция input() получает на вход строку
print('Hello,', name)

x = int(input('x: '))
print(x, type(x))

# x = float(input('x: '))
# print(x, type(x))
'''



M = [1, 3, 5,2 , 21, 32,43,1,1,23,1,3,1,32,3,143,13,2,134,2,321,3,123,12,3,23,1]
M = set(M)
print(M)
9






