# region Домашка: ******************************************************************************



# endregion Домашка: ******************************************************************************


# region Урок: ******************************************************************************

# Тип 15 № 29663
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».  # n % m == 0
#
# Для какого наибольшего натурального числа А формула
#
# (A < 50) ∧ (¬ДЕЛ(x, А) → (ДЕЛ(x, 10) → ¬ДЕЛ(x, 12)))
#
# тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной x)?
'''
def F(x, A):
    return (A < 50) and ((x % A != 0) <= ((x % 10 == 0) <= (x % 12 != 0)))

for A in range(1, 1000000):
    flag = True
    for x in range(1, 1000):
        if F(x, A) == False:
            flag = False
            break
    if flag == True:
        print(A)
'''

# Вариант 2 - основной
'''
def F(x, A):
    return (A < 50) and ((x % A != 0) <= ((x % 10 == 0) <= (x % 12 != 0)))

for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 1000)):
        print(A)
'''

'''
for A in range(1, 10000):
    if all(((A < 50) and ((x % A != 0) <= ((x % 10 == 0) <= (x % 12 != 0)))) for x in range(1, 1000)):
        print(A)
'''

# Вариант 4
'''
print(max([A for A in range(1, 10000) if all(((A < 50) and ((x % A != 0) <= ((x % 10 == 0) <= (x % 12 != 0)))) for x in range(1, 1000))]))
'''
# Ответ: 30


# Тип 15 № 34512
# Обозначим через m & n поразрядную конъюнкцию неотрицательных целых чисел m и n.
#
# Например, 14 & 5 = 11102 & 01012 = 01002 = 4.
#
# Для какого наименьшего неотрицательного целого числа А формула
#
# x&77 ≠ 0 → (x&12 = 0 → x&А ≠ 0)
#
# тождественно истинна (т. е. принимает значение 1 при любом неотрицательном целом значении переменной х)?
'''
def F(x, A):
    return (x&77 != 0) <= ((x&12 == 0) <= (x&A!= 0))

for A in range(0, 1000):
    if all(F(x, A) for x in range(0, 1000)):
        print(A)
        break
'''
# Ответ: 65


# Тип 15 № 27017 i
# Для какого наибольшего целого неотрицательного числа А выражение
#
# (x·y < 100) ∨ (y ≥ A) ∨ (x > A)
#
# тождественно истинно, т.е. принимает значение 1 при любых целых неотрицательных x и y?
'''
def F(x, y, A):
    return (x * y < 100) or (y >= A) or (x > A)

for A in range(0, 1000):
    if all(F(x, y, A) for x in range(0, 100) for y in range(0, 100)):
        print(A)
'''
# Ответ: 10

# Тип 15 № 34535
# На числовой прямой даны три отрезка: P = [10, 40], Q = [5, 15] и R = [35, 50].
# Какова наименьшая возможная длина промежутка A, что формула
#
# ( (x ∈ А) ∨ (x ∈ P) ) ∨ ((x ∈ Q)→ (x ∈ R))
#
# тождественно истинна, то есть принимает значение 1 при любом значении переменной х.

def F(x, a1, a2):
    # return ((a1 <= x <= a2) or (10 <= x <= 40)) or ((5 <= x <= 15) <= (35 <= x <= 50))
    P = 10 <= x <= 40
    Q = 5 <= x <= 15
    R = 35 <= x <= 50
    A = a1 <= x <= a2
    return (A or P) or (Q <= R)

R = []
M = [i/5 for i in range(0*5, 60*5)]
print(M)
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(round(min(R)))
# Ответ: 5

# endregion Урок: ******************************************************************************


# todo: Артем = [2, 5, 8, 12, 14, 15, 16, 23]
# на прошлом уроке: Разбирали 15 номера, всех типов.
# на следующем уроке:
