
# region Домашка: *********************************************************************

# endregion Домашка: ******************************************************************

# region Урок: *********************************************************************

# 8. 11616
# 9. 11617
# 13. 11791
# 14. 11622
# 18. 11626
# 23. 11629
# 24. 11630
# 25. 11718

'''
from itertools import *

k = 0
alph = '0123456789ABCDEFG'
nech = alph[3::2]
for i in product(alph, repeat=5):
    s = ''.join(i)
    if s.count('1') <= 2 and s[0] != '0':
        for x in nech:
            s = s.replace(x, "*")
        if '*1' not in s and '1*' not in s and '11' not in s:
            k += 1
print(k)
'''

alphabet = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
a = '0123456789ABCDEFGHIJ'
for x in alphabet[:20]:
    if all((int(f'5{y}4{x}{y}4HJ4', 20) + int(f'4{y}6B{y}{x}1', 20)) % 15 == 0 for y in alphabet[:20]):
        print((int(f'5{8}4{x}{8}4HJ4', 20) + int(f'4{8}6B{8}{x}1', 20)))


# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************


# GOAL = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:



