# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************
'''
f = open('26.txt')
N = int(f.readline())
M = sorted([int(x) for x in f])

summa1 = sum(M) - sum(M[:2500]) / 2
# summa2 = sum(M) - sum(M[7500:]) / 2
summa2 = sum(M) - sum(M[::-1][:2500]) / 2
print(summa2, summa1)
'''


# № 4712 Демоверсия 2023 (Уровень: Базовый)
'''
f = open('26.txt')
N = int(f.readline())
M = sorted([int(x) for x in f])[::-1]

R = [M.pop(0)]
for x in M:
    if x <= R[-1] - 3:
        R.append(x)
print(len(R), min(R))
'''

# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************


# Никита = [3, 5, 7, 8, 9, 11, 12, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:
