# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# Тип 25 №36038

# Пусть M — сумма минимального и максимального натуральных делителей целого числа, не считая единицы и самого числа.
# Если таких делителей у числа нет, то считаем значение M равным нулю.
#
# Напишите программу, которая перебирает целые числа, большие 452021, в порядке возрастания и ищет среди них такие,
# для которых значение M при делении на 7 даёт в остатке 3.
# Вывести первые 5 найденных чисел и соответствующие им значения M.

def F(n):
    div = []
    for i in range(2, int(n**0.5) + 1):  #  не считая единицы и самого числа
        if n % i == 0:
            div += [i, n // i]
    return sorted(set(div))


count = 0
for i in range(452021, 600000):
    if count == 5:
        exit()
    d = F(i)
    if len(d) != 0:
        M = d[0] + d[-1]
        # M = max(d) + min(d)
        if M % 7 == 3:
            print(i, M)
            count += 1

# 452025 150678
# 452029 23810
# 452034 226019
# 452048 226026
# 452062 226033



# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************


# Никита = [5.1, 7.1, 8.1, 9.1, 12.1, 14.1, 15.1, 16.1, 17.1, 19-21.1, 23.1, 24.1, 25.1]
# КЕГЭ  = []
# на следующем уроке:
