# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# 17 номер
'''
M = [int(x) for x in open('17.txt')]
A = [x for x in M if str(x)[-1] == '3' and len(str(abs(x))) == 4]
R = []
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    print(x, y, z, [abs(p) % 10 == 3 for p in [x, y, z]])
    # if sum([abs(p) % 10 == 3 for p in [x, y, z]]) != 3:
    if sum([str(p)[-1] == '3' for p in [x, y, z]]) != 3:
        if (x + y + z) >= min(A):
            R.append(x + y + z)
print(len(R), max(R))
'''


# 7 номер - задание про растровую графику

# I = pixels * i
# Вес картинки = все пиrсели * бит на один пиксель

# colors = 2 ** i
# Кол-во цветов = 2 ** бит на один пиксель
'''
i = 12 * 8
pixels = 2688 * 344
I = pixels * i  # бит
U = 49152  # бит / сек
print(I / U)
'''

# 11 номер
'''
symbols = 491
alphabet = 9575 + 10
# alphabet = 2 ** i  (бит на один символ)
i = 14    # alphabet < 2**14
bit = symbols * i
print(bit / 8)  # 859.25
byte = 860
I = (byte * 23552) / (2**10)
print(I)
'''

# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************


# Никита = [5.1, 7.1, 8.1, 9.1, 12.1, 14.1, 15.1, 16.1, 17.1, 23.1, 24.1, 25.1]
# КЕГЭ  = []
# на следующем уроке:
