# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************
'''
from itertools import *
cnt = 0
for s in product('01234567', repeat=5):
    word = ''.join(s)
    if word[0] != '0':
        if len(set(word)) == len(word) - 2:
            if any(x in word for x in '000 111 222 333 444 555 666 777'.split()):
                cnt += 1
                print(word)
print(cnt)
'''
# Ответ: 882

import math
print(math.modf(1.0))



# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************


# Никита = [3, 5, 7, 8, 9, 11, 12, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:
