# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# Тип 15 №29663
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».
# Для какого наибольшего натурального числа А формула
# (A < 50) ∧ (¬ДЕЛ(x, А) → (ДЕЛ(x, 10) → ¬ДЕЛ(x, 12)))
#
# тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной x)?
'''
# Вариант 1
def F(A, x):
    return (A < 50) and ((x % A != 0) <= ((x % 10 == 0) <= (x % 12 != 0)))


for A in range(1000, 0, -1):
    flag = True
    for x in range(1, 1000):
        if F(A, x) == False:
            flag = False
            break
    if flag == True:
        print(A)
        break

# Вариант 2
def F(A, x):
    return (A < 50) and ((x % A != 0) <= ((x % 10 == 0) <= (x % 12 != 0)))

for A in range(1000, 0, -1):
    if all(F(A, x) for x in range(1, 1000)):
        print(A)
        break

# Вариант 3
def F(A, x):
    return (A < 50) and ((x % A != 0) <= ((x % 10 == 0) <= (x % 12 != 0)))

R = []
for A in range(1, 1000):
    if all(F(A, x) for x in range(1, 1000)):
        R.append(A)
print(max(R))

# Вариант 4
print(max([A for A in range(1, 1000) if all(((A < 50) and ((x % A != 0) <= ((x % 10 == 0) <= (x % 12 != 0)))) for x in range(1, 1000))]))
'''
# Ответ: 30


# print(14 & 5)  # 4

# Тип 15 №34506
# Обозначим через m&n поразрядную конъюнкцию неотрицательных целых чисел m и n.
# Так, например, 14&5 = 1110_2 & 0101_2 = 0100_2 = 4.
#
# Для какого наименьшего неотрицательного целого числа А формула
# x&25 ≠ 0 → (x&17 = 0 → x&А ≠ 0)
# тождественно истинна (т.е. принимает значение 1 при любом неотрицательном целом значении переменной х)?
'''
def F(x, A):
    return (x&25 != 0) <= ((x&17 == 0) <= (x&A != 0))

for A in range(0, 1000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
        break
'''


# Тип 15 №14233
# На числовой прямой даны два отрезка: P = [17, 46] и Q = [22, 57].
# Отрезок A таков, что приведённая ниже формула истинна при любом значении переменной х:
#
# ¬(x ∈ A) →(((x ∈ P) ⋀ (x ∈ Q)) → (x ∈ A))
#
# Какова наименьшая возможная длина отрезка A?

def F(x, a1, a2):
    P = 17 <= x <= 46
    Q = 22 <= x <= 57
    A = a1 <= x <= a2
    return (not A) <= ((P and Q) <= A)


R = []
M = [x/5 for x in range(10*5, 60*5)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(min(R))


# Тип 15 №58482
# На числовой прямой даны три отрезка: P=[24;77], Q[47;92] и R=[82;116].
#
# Укажите наименьшую возможную длину такого отрезка A, для которого формула
#
# (¬((x∈Q)→((x∈P)∨(x∈R)))→(¬(x∈A)→¬(x∈Q))
#
# тождественно истинна (т.е. принимает значение 1 при любом значении переменной х).

def F(x, a1, a2):
    P = 24 <= x <= 77
    Q = 47 <= x <= 92
    R = 82 <= x <= 116
    A = a1 <= x <= a2
    return ((not(Q <= (P or R)))) <= ((not A) <= (not Q))


R = []
M = [x/5 for x in range(10*5, 120*5)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(min(R))

# 4.599999999999994 -> 5


# endregion Урок: ******************************************************************

# Никита = [5.1, 8.1, 12.1, 14.1, 15.1, 16.1, 23.1]
# КЕГЭ  = []
# на следующем уроке:
