# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# № 12453 (Уровень: Базовый)
# (Л. Шастин) Леонид составляет коды перестановкой букв слова СОВЕСТЬ.
# При этом в кодах не должно быть двух стоящих рядом гласных и двух стоящих рядом согласных одновременно.
# Сколько различных кодов может составить Леонид?
# Примечание: в этой задаче мягкий знак принять за гласную букву.
'''
from itertools import permutations
cnt = set()
for s in permutations('СОВЕСТЬ'):
    slovo = ''.join(s)
    word = slovo
    slovo = slovo.replace('Е', 'О').replace('Ь', 'О')
    slovo = slovo.replace('С', 'В').replace('Т', 'В')
    if not('ОО' in slovo and 'ВВ' in slovo):
        print(slovo)
        cnt.add(word)
print(len(cnt))
'''

# ¬(x&79=0)∧(x&31=0→¬(x&А=0))
def F(x, A):
    return ((not (x & 79 == 0)) and (x & 31 == 0 <= (not (x & A == 0))))
# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************


# Никита = [3, 5, 7, 8, 9, 12, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке: Повторить 11 номера и разобрать 22
