
# region Домашка: ******************************************************************

# КЕГЭ № 2499 (Уровень: Базовый)
#
# Текстовый файл состоит не более чем из 106 символов X, Y и Z.
#
# Сколько раз в файле встречается последовательность символов XXXX?
'''
s = open('24.txt').readline()
count = 0
for i in range(len(s)-3):
    if s[i] + s[i+1] + s[i+2] + s[i+3] == 'XXXX':
        count += 1
print(count)
'''


# КЕГЭ № 2509 (Уровень: Средний)
#
# Текстовый файл состоит не более чем из 10**6 символов и содержит
# только заглавные буквы латинского алфавита (ABC…Z).
# Определите количество самого частого и самого редкого символа
# в файле (без учёта символа окончания строки).
# В качестве ответа запишите разницу между ними.
'''
s = open('24.txt').readline()
R = []
alphabet = set(s)
for a in alphabet:
    R.append([s.count(a), a])

"""
for x in sorted(R):
    print(*x)
"""
print(38820 - 37934)
'''

# endregion Домашка: ******************************************************************


# region Урок: ********************************************************************

import time
start = time.time()

def prime(x):
    div = []
    for j in range(1, int(x ** 0.5) + 1):
        if x % j == 0:
            div.append(j)
            div.append(x // j)
    return sorted(set(div))

def divisors(x):
    div = []
    for j in range(1, int(x ** 0.5)+1):
        if x % j == 0:
            if len(prime(j)) == 2 and len(prime(x // j)) == 2:
                div.append(j)
                div.append(x // j)
    return sorted(set(div))


for x in range(125697, 125721+1):
    d = divisors(x)
    if len(d) == 2:
        print(*d)

end = time.time()
print(end-start)

# endregion Урок: ******************************************************************

# Варя = [1.1, 2.1, 5.1, 6.1, 8.1, 9.1, 12.1, 14.1, 15.1, 16.1, 17.1, 23.1, 24.1, 25.1]
# КЕГЭ  = []
# на следующем уроке:
