
# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************


# region Урок: ********************************************************************

# Тип 2 №36857
# Логическая функция F задаётся выражением ((¬x ∨ z) ≡ (y ∧ ¬w)) → (z ∧ y).

print('x y z w F')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                F = (((not x) or z) == (y and (not w))) <= (z and y)
                if not F:
                    print(x, y, z, w, int(F))

# endregion Урок: ******************************************************************


# todo: Варя = []
# todo: КЕГЭ  = []
# на прошлом уроке:
# на следующем уроке:
