# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ********************************************************************

# todo: Проверить и разобрать, почему не сходится максимальная сумма чисел
'''
M = [int(x) for x in open('17.txt')]
k = []
l = [x for x in M if len(str(abs(x))) == 5 and str(x)[-1] == '3']
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    n = [a for a in (x, y, z) if str(a)[-1] == '3']
    if len(n) >= 1:
    if str(x)[-1] == '3' or str(y)[-1] == '3' or str(z)[-1] == '3':
        if (x + y + z) <= max(l):
            k.append(x+y+z)
print(len(k), max(l))
'''
# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************


# Варя = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ  = [5, 8, 9, 14, 17]
# на следующем уроке:

