# region Домашка: ******************************************************************

# № 10773 (Уровень: Базовый)
# Для узла с IP-адресом 133.57.64.130 адрес сети равен 133.57.64.0.
# Для скольких различных значений маски это возможно?
'''
from ipaddress import *

for mask in range(32+1):
    net = ip_network(f'133.57.64.130/{mask}', 0)
    print(net, net.netmask)
    # 133.57.64.0/18 255.255.192.0
    # 133.57.64.0/19 255.255.224.0
    # 133.57.64.0/20 255.255.240.0
    # 133.57.64.0/21 255.255.248.0
    # 133.57.64.0/22 255.255.252.0
    # 133.57.64.0/23 255.255.254.0
    # 133.57.64.0/24 255.255.255.0
'''
# Ответ: 7


# №11780
'''
from ipaddress import *
C = []
m = 0
net = ip_network(f'185.8.0.0/255.255.128.0', 0)
for ip in net:
    if f'{ip:b}'.count('1') > m:
        C.append(f'{ip:b}'.count('1'))
print(max(C))
'''


# КЕГЭ № 10715 (Уровень: Средний)
# Сеть задана IP-адресом 192.168.32.160 и маской сети 255.255.255.240.
# Сколько в этой сети IP-адресов, для которых количество нулей в двоичной записи IP-адреса больше 21?
# В ответе укажите только число.
'''
from ipaddress import *
cnt = 0
net = ip_network(f'192.168.32.160/255.255.255.240', 0)
for ip in net:
    if f'{ip:b}'.count('0') > 21:
        cnt += 1
print(cnt)
'''


#
# № 13253 (Уровень: Базовый)
# (Я. Рябков) Павел составляет два списка из слов:
# в одном всевозможные 5-буквенные слова,
# составленные из набора букв К, О, Н, Е, Ц, в другом
# всевозможные 5-буквенные слова, составленные из набора букв Д, Р, А, К, О, Н.
# Каждая из допустимых букв может встречаться в словах любое количество раз или не встречаться совсем.

from itertools import *
M, F = [], []
for s in product('КОНЕЦ', repeat=5):
    slovo = ''.join(s)
    M.append(slovo)

for s2 in product('ДРАКОН', repeat=5):
    slovo2 = ''.join(s2)
    F.append(slovo2)

cnt = 0
for x in M + F:
    if (x in M) != (x in F):
        cnt += 1
print(cnt)

# Найдите количество слов, которые присутствуют только в одном из списков.



# endregion Домашка: ******************************************************************


# region Урок: ********************************************************************


# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************


# Варя = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ  = [5, 14]
# на следующем уроке:

