# region Домашка:  ******************************************************************************



# endregion Домашка:  ******************************************************************************


# region Урок:  ******************************************************************************

# int - целые числа
# float - дроби
# str - строки, то есть любой текст


# Площадь треугольника
'''
a = float(input('a: '))
b = float(input('b: '))
S = (1/2) * a * b
print(S)
'''


# Следующее и предыдущее
'''
x = int(input('x: '))
print(f'Следующее число после {x} это {x+1}')
print(f'Предыдущее число перед {x} это {x-1}')  # f-строка
'''

# Объем куба
'''
a = int(input('Введите длину ребра куба: '))
print(f'Объем куба: {a ** 3}')
print(f'Площадь куба: {6*a**2}')
'''


# endregion Урок:  ******************************************************************************


# todo: Богдан = [], на следующем уроке: Обсуждаем дз, отвечаем на вопросы. Разбираем тему списков и строк (частично)
