# region Домашка:  ******************************************************************************



# endregion Домашка:  ******************************************************************************


# region Урок:  ******************************************************************************


# Тип 2
'''
print('x y z w')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                # F = (x and (not y)) or (x == z) or (not w)  # 25832
                # F = (x <= y) and (y == (not z)) and (z or w)  # 27531
                # F = ((not x) and (not y)) or (y == z) or (not w)  # 16029
                # F = ((not z) == y) <= ((w and (not x)) == (y and x))  # 39231
                # F = ((x <= y) and (z or w)) <= ((x == w) or (y and (not z)))  # 40718  todo домашка
                F = (y <= z) and (not((y or w) <= (z and x)))  # 35891
                if F == True:
                    print(x, y, z, w)
'''


# endregion Урок:  ******************************************************************************

# todo: Бронислав = [1-, 2, 3, 4, 5, 6-, 8, 9, 10, 12, 14, 15, 16, 18-, 19-21-, 22, 23]
# todo:   КЕГЭ    = []
# на прошлом уроке: Половину урока прорешивали 2 номера (составление таблиц) и разобрали 3, 22 номера через ВПР (записали видео).
# на следующем уроке: #todo: если на след. уроке останутся вопросы по Теории игры, то разобрать. Аналогично 3, 22
