# region Домашка: ******************************************************************


# endregion Домашка: *****************************************************************


# region Урок: ******************************************************************

# Тип 15 №33485
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».
# Для какого наибольшего натурального числа А формула
# ДЕЛ(120, A) ∧ (¬ДЕЛ(x, А) → (ДЕЛ(x, 18) → ¬ДЕЛ(x, 24)))
# тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной x)?

# Вариант 1
'''
def F(x, A):
    return (120 % A == 0) and ((x % A != 0) <= ((x % 18 == 0) <= (x % 24 != 0)))


for A in range(1, 1000):
    flag = True
    for x in range(1, 10000):
        if F(x, A) == False:
            flag = False
            break
    if flag == True:
        print(A)
'''

# Вариант 2
'''
def F(x, A):
    return (120 % A == 0) and ((x % A != 0) <= ((x % 18 == 0) <= (x % 24 != 0)))


for A in range(1, 1000):
    k = 0
    for x in range(1, 10000):
        if F(x, A):
            k += 1
    if k == 9999:
        print(A)
'''

# Вариант 3.1
'''
def F(x, A):
    return (120 % A == 0) and ((x % A != 0) <= ((x % 18 == 0) <= (x % 24 != 0)))


for A in range(1, 1000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
'''

# Вариант 3.2
'''
def F(x, A):
    return (120 % A == 0) and ((x % A != 0) <= ((x % 18 == 0) <= (x % 24 != 0)))


R = []
for A in range(1, 1000):
    if all(F(x, A) for x in range(1, 10000)):
        R.append(A)
print(max(R))
'''


# Вариант 3.2
'''
print(max([A for A in range(1, 1000) if all(((120 % A == 0) and ((x % A != 0) <= ((x % 18 == 0) <= (x % 24 != 0)))) for x in range(1, 10000))]))
'''

# Ответ: 24


# Тип 15 №17336
# Для какого наименьшего целого неотрицательного числа A выражение
# (3x + 4y ≠ 60) ∨ ((A ≥ x) ∧ (A ≥ y))
# тождественно истинно при любых целых неотрицательных x и y?
'''
def F(x, y, A):
    return (3*x + 4*y != 60) or ((A >= x) and (A >= y))


for A in range(0, 1000):
    if all(F(x, y, A) for x in range(100) for y in range(100)):
        print(A)
        break
'''


# Тип 15 №34539
# На числовой прямой даны два отрезка: Р = [22, 72] и Q = [42, 102], A = [a1, a2]
# Какова наименьшая возможная длина интервала A, что логическое выражение
# ¬(¬(х ∈ А) ∧ (х ∈ Р)) ∨ (х ∈ Q)
# тождественно истинно, то есть принимает значение 1 при любом значении переменной х.
'''
def F(x, a1, a2):
    P = 22 <= x <= 72
    Q = 42 <= x <= 102
    A = a1 <= x <= a2
    return (not((not A) and P)) or Q


R = []
M = [x / 10 for x in range(20 * 10, 110 * 10)]
print(M)
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(min(R))
'''
# Ответ: 19.75 -> 19.799 -> 19.9 -> 20



# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************


# Дмитрий = [2, 5, 8, 12, 14, 15, 16, 23]
# КЕГЭ  = []
# на следующем уроке:
