# region Домашка: ******************************************************************


# endregion Домашка: *****************************************************************


# region Урок: ******************************************************************


print('x y z w F')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                # F = y and (x or z) or (not(y or z)) or w  # № 12234 ЕГКР 16.12.23 (Уровень: Базовый)  # y∧(x∨z)∨¬(y∨z)∨w
                # F = ((y and (x == (not z))) <= w) and (z <= y) #11650 (Уровень: Базовый) ((y∧(x≡¬z))→w)∧(z→y)
                F = (x <= y) and ((not y) <= z) and w  # № 11606 (Уровень: Базовый) (x→y)∧(¬y→z)∧w
                if F:
                    print(x, y, z, w, int(F))



# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************


# Дмитрий = []
# КЕГЭ  = []
# на следующем уроке:
