# region Домашка: ******************************************************************************


# endregion Домашка: ******************************************************************************


# region Урок: ******************************************************************************

# Задание 7.
# (А.Богданов) В студии записали вокал длительностью 8 минут 32 секунды в режиме квадро на частоте 192кГц.
# Несжатые данные ровно за три четверти минуты записали на флешку .
# Известно, что флешка записывает данные на скорости 25 МБайт/с.
# Определите исходную глубину кодирования одной дорожки (в битах).
'''
# I (бит) = a (шт) * b (Гц) * c (бит) * t (сек)
# I = 4 * (192 * 1000) * c * (8 * 60 + 32)

# T = три четверти минуты = 3/4 минуты = 45 сек

# U = 25 МБайт/с = 25 * 2 ** 23 бит/сек
# U = I / T
# U = (4 * (192 * 1000) * c * (8 * 60 + 32)) / T
# (25 * 2 ** 23) = (4 * (192 * 1000) * c * (8 * 60 + 32)) / (45)
c = ((25 * 2 ** 23) * 45) / (4 * (192 * 1000) * (8 * 60 + 32))
print(c)
'''
# Ответ: 24 бит



# endregion Урок: ******************************************************************************


# todo: Данил = [2, 3, 5, 7.1, 8, 9.1, 12, 14+, 15+, 16, 17, 18, 19-21, 22, 23, 24, 25.2]
# на прошлом уроке:
# на следующем уроке:
