# region Домашка: ******************************************************************

# КЕГЭ № 780 Джобс 30.11.2020 (Уровень: Сложный) 🌶
# Алгоритм вычисления функцийF(n) задан следующими соотношениями:
# F(n) = 1 при n=0
# F(n) = 2⋅F(1−n) + 3⋅F(n−1) + 2 при n>0
# F(n) = −F(−n) при n<0
# Чему равна сумма цифр значения функции F(50)?
'''
from functools import *

@lru_cache(None)
def F(n):
    if n == 0:
        return 1
    if n > 0:
        return 2*F(1-n) + 3*F(n-1) + 2
    if n < 0:
        return -F(-n)

# print(F(50))
print(sum([int(x) for x in str(F(50))]))
'''
# Ответ: 6

'''
# Изначально было: 5
print(F(1))  # 7
print(F(2))  # 9
print(F(3))  # 11
print(F(4))  # 13
print(F(5))
print(F(6))
# ...
print(F(50))  # 105 -> 6
'''
# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# Тип 15 №33760
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».
# Для какого наибольшего натурального числа А формула
# ДЕЛ(120, A) ∧ (ДЕЛ(x, 36) → (¬ДЕЛ(x, А) → ¬ДЕЛ(x, 45)))
# тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной x)?

# Вариант 1
'''
def F(x, A):
    return (120 % A == 0) and ((x % 36 == 0) <= ((x % A != 0) <= (x % 45 != 0)))


for A in range(1, 10000):
    flag = True
    for x in range(1, 10000):
        if F(x, A) == False:
            flag = False
            break
    if flag == True:
        print(A)
'''

# Вариант 2
'''
def F(x, A):
    return (120 % A == 0) and ((x % 36 == 0) <= ((x % A != 0) <= (x % 45 != 0)))


for A in range(1, 100):
    k = 0
    for x in range(1, 10000):
        if F(x, A):
            k += 1
    if k == 9999:
        print(A)
'''

# Вариант 3.1
'''
def F(x, A):
    return (120 % A == 0) and ((x % 36 == 0) <= ((x % A != 0) <= (x % 45 != 0)))


for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
'''

# Вариант 3.2
'''
def F(x, A):
    return (120 % A == 0) and ((x % 36 == 0) <= ((x % A != 0) <= (x % 45 != 0)))


for A in range(10000, 1, -1):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
        break
'''

# Вариант 3.3
'''
def F(x, A):
    return (120 % A == 0) and ((x % 36 == 0) <= ((x % A != 0) <= (x % 45 != 0)))


R = []
for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        R.append(A)
print(max(R))
'''

# Вариант 3.4
'''
print(max([A for A in range(1, 10000) if all(((120 % A == 0) and ((x % 36 == 0) <= ((x % A != 0) <= (x % 45 != 0)))) for x in range(1, 10000))]))
'''
# Ответ: 60


# Тип 15 №59752
# Для какого наименьшего целого неотрицательного числа А выражение
# (x + 2y < A) ∨ (y < x) ∨ (y > 60) тождественно истинно?
'''
def F(x, y, A):
    return (x + 2*y < A) or (y < x) or (y > 60)

for A in range (1, 1000):
    if all(F(x, y, A) for x in range(1, 100) for y in range (1, 100)):
        print(A)
'''

# print(14 & 5)  # 4

# Тип 15 №39244
# Для какого наименьшего неотрицательного целого числа А формула
# (x & 105 = 0) → ((x & 58 ≠ 0) → (x & А ≠ 0))
# тождественно истинна (т. е. принимает значение 1 при любом неотрицательном целом значении переменной x)?
'''
def F(x, A):
    return (x & 105 == 0) <= ((x & 58 != 0) <= (x & A != 0))
    
for A in range(1, 1000):
    if all(F(x, A) for x in range (1, 10000)):
        print(A)
        break
'''


# Тип 15 №34545
# На числовой прямой даны два отрезка: P = [12, 62] и Q = [32, 92].
# Какова наименьшая возможная длина интервала A, что формула
# (¬(x ∈ А) ∧ (x ∈ Q)) → (x ∈ P)
# тождественно истинна, т. е. принимает значение 1 при любом значении переменной х.

'''
def F(x, a1, a2):
    P = 12 <= x <= 62
    Q = 32 <= x <= 92
    A = a1 <= x <= a2
    return ((not A) and Q) <= P


R = []
M = [x / 10 for x in range(10 * 10, 100 * 10)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(min(R))
'''
# 29.75 -> 29.799 -> 29.9 -> 30


# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************


# Данил = [2, 5, 6, 8, 12, 14, 15, 16, 23]
# КЕГЭ  = []
# на следующем уроке:
