
# region Домашка: ************************************************************

# an = a1 + d(n−1)
#
# Входные данные
# На вход программе подаётся три целых числа: a1, d и n, каждое на отдельной строке.
#
# Выходные данные
# Программа должна вывести n-ый член арифметической прогрессии.

a1 = int(input())
d = int(input())
n = int(input())
an = a1 + d * (n - 1)
print(an)

# endregion Домашка: ************************************************************


# region Урок: ************************************************************


# endregion Урок: ************************************************************


# todo: Евгений = [2.1, 8.1]
# на прошлом уроке:
# на следующем уроке:
