# region Домашка: ************************************************************



# endregion Домашка: ************************************************************



# region Урок: ************************************************************

# Четырехзначное число
'''
x = int(input())
s = str(x)

print(f'Цифра в позиции тысяч равна {s[0]}')
print(f'Цифра в позиции сотен {s[1]}')
print(f'Цифра в позиции десятков равна {s[2]}')
print(f'Цифра в позиции единиц равна {s[3]}')
'''

# 3457
'''
x = int(input())
x1 = x // 1000
print(f'Цифра в позиции тысяч равна {x1}')
x2 = abs(x1 * 10 - x // 100)
print(f'Цифра в позиции сотен {x2}')
x3 = abs(x // 10 - (x1*100 + x2 * 10))
print(f'Цифра в позиции десятков равна {x3}')
x4 = x % 10
print(f'Цифра в позиции единиц равна {x4}')
'''

# endregion Урок: ************************************************************



# todo: Евгений = []
# на прошлом уроке: Разобрали арифметические действия, условные операторы и ввод с клавиатуры.
# на следующем уроке:
