# region Домашка: ************************************************************



# endregion Домашка: ************************************************************
'''
print(type('3' * 4))
print('3' * 4 + 6)
'''

'''
L = []  # L = list()
T = ()  # T = tuple()
D = {}  # D = dict()
S = set() # создать пустое множество можно только таким образом

S = set()
print(type(S))  # <class 'set'>

s = {}
print(type(s))  # <class 'dict'>
'''
# TypeError: can only concatenate str (not "int") to str


# region Урок: ************************************************************

# Ввод данных с клавиатуры
'''
a: int = 5
print(a, type(a))

a = str(a)
print(a, type(a))

a = float(a)
print(a, type(a))

a = int(a)
print(a, type(a))

b: float = 5.32
c: str = '45привет'
d: bool = True

a = int(input('Введите число a: '))

print(f'{a} + {b} = {a + b}')  # 10 + 5.32 = 15.32
'''


# Арифметические действия
'''
a = 7
b = 2
print(f"{a} + {b} = {a + b}\n"
      f"{a} - {b} = {a - b}\n"
      f"{a} * {b} = {a * b}\n")

print(f"Деления в Python:\n"
      f"{a} / {b} = {a / b} - Вещественное деление\n"
      f"{a} // {b} = {a // b} - Целочисленное деление\n"
      f"{a} % {b} = {a % b} - Остаток от деления\n")

print(f"Возведите {a} в степень {b}: {a}**{b}={a ** 2}\n"
      f"Взять квадратный корень от 16: 16**(1/2) = {16 ** (1/2)}\n"
      f"Взять кубический корень от 27: 27**(1/3) = {27 ** (1/3)}")
'''


# Условные операторы (ветвление)
'''
x = int(input('x: '))
y = int(input('y: '))

# if - если (если переданное условие истинно, то выполняем)
# elif - иначе если (рассматриваются все промежуточные состояния)
# else - иначе (если все условия сверху не выполнимы)

if x > 0 and y > 0:  # or
    print('Первая четверть')
elif x < 0 and y > 0:
    print('Вторая четверть')
elif x < 0 and y < 0:
    print('Третья четверть')
elif x > 0 and y < 0:
    print('Четвертая четверть')
else:
    print('Лежит на оси')
'''


# Каскадные условия
'''
if x > 0:
    if y > 0:  # x > 0 and y > 0
        print('Первая четверть')
    else:  # x > 0 and y <= 0
        print('Четвертая четверть')
else:
    if y > 0:  # x <= 0  and y > 0
        print('Вторая четверть')
    else:  # x <= 0 and y <= 0
        print('Третья четверть')
 '''

# Напишем простейший калькулятор
'''
a = int(input('a: '))
s = input('s: ')
b = int(input('b: '))

if s == '+':
    print(f'{a} {s} {b} = {a+b}')
elif s == '-':
    print(f'{a} {s} {b} = {a-b}')
elif s == '*':
    print(f'{a} {s} {b} = {a*b}')
# elif s == '/' and b == 0:
#     print('Нельзя делить на нуль!')
elif s == '/':
    try:  # пример работы с исключениями
        print(f'{a} {s} {b} = {a/b}')  # ZeroDivisionError: division by zero
    except ZeroDivisionError:
        print('Нельзя делить на нуль!')
'''


# endregion Урок: ************************************************************



# todo: Евгений = []
# на прошлом уроке: Разобрали арифметические действия, условные операторы и ввод с клавиатуры.
# на следующем уроке:
