# region Домашка:  **************************************************


# endregion Домашка: **************************************************


# region Урок:  **************************************************

#
# № 3576 Апробация 27.04.2022 (Уровень: Базовый)
# Значение арифметического выражения
#
# 5 * 216**3031 + 4 * 36**3042 * 3 * 6**3053 * 3064
#
# записали в системе счисления с основанием 6. Определите сумму цифр в записи этого числа.

x = 5 * 216**3031 + 4 * 36**3042 - 3 * 6**3053 - 3064
M = []
while x > 0:
    M.append(x % 6)
    x //= 6
M.reverse()
print(sum(M))

# Показать ответ: 30417

# endregion Урок:  **************************************************

import useful
print(useful.Who_Is_Name())

# todo: Денис = [1, 2, 3, 4, 5, 8, 9, 16, 17, 18, 19-21, 22, 23, 24], на следующем уроке:
# на прошлом уроке: Каждый взял по варианту Лени Шастина. Кирилл: Вариант 3, Денис Вариант 4.
# на следующем уроке:
