# region Домашка:  **************************************************


# endregion Домашка: **************************************************


# region Урок:  **************************************************

# № 6782 (Уровень: Средний)
# (PRO100 ЕГЭ) Определите количество шестизначных чисел, записанных в восьмеричной системе счисления,
# в записи которых есть ровно две цифры 6, при этом никакая нечётная цифра не стоит рядом с цифрой 6.

A = '16 61 36 63 56 65 76 67'.split()

# Вариант 1
'''
s = '01234567'
count = 0
for a in '1234567':
    for b in s:
        for c in s:
            for d in s:
                for e in s:
                    for f in s:
                        slovo = a + b + c + d + e + f
                        if slovo.count('6') == 2 and a != '0':
                            if all(x not in slovo for x in '16 61 36 63 56 65 76 67'.split()):
                                count += 1
print(count)
'''

# Вариант 2
'''
import itertools
count = 0
for s in itertools.product('01234567', repeat=6):  # ('7', '7', '7', '4', '5', '2')
    slovo = ''.join(s)
    if slovo.count('6') == 2 and slovo[0] != '0':
        if all(x not in slovo for x in '16 61 36 63 56 65 76 67'.split()):
            count += 1
print(count)
'''
# Показать ответ: 5229

# endregion Урок:  **************************************************

import useful
print(useful.who_is_name())

# todo: Денис = [2, 3, 5, 9, 16, 17, 18, 19-21, 22, 23, 24], на следующем уроке:
# на прошлом уроке: Разбирали 3, 22 номера решение через ВПР и повторили один 8 номер на цифры
# на следующем уроке: Поразбирать 8 номера с any all
