
# region Домашка: ******************************************************************************



# endregion Домашка: ******************************************************************************


# region Урок: ******************************************************************************
'''
s = open('24.txt').readline()
for x in '0123456789QWERTYUIOPSFGHJKLZXCVBNM':
    s = s.replace(x, '*')
M = [max(i.index('D'), len(i) - i.index('D')) for i in s.split('A') if 'D' in i]
print(max(M)+1)
'''

'''
s = open('24.txt').readline()
s = s.replace('A', '* *').replace('D', '+ +')
M = [len(i) for i in s.split() if '+' in i and '*' in i]
print(max(M))
'''



# № 8425 (Уровень: Средний)
# В системе счисления с основанием p выполняется равенство 32⋅14=xy2.
# Буквами x и y обозначены некоторые цифры из алфавита системы счисления с основанием p.
# Определите значение числа yx_p и запишите это значение в десятичной системе счисления.
'''
ALPHABET = sorted('0123456789QWERTYUIOPASDFGHJKLXZXCVBNM')
for p in range(5, 36):
    for x in ALPHABET[:p]:
        for y in ALPHABET[:p]:
            if int('32', p) * int('14', p) == int(f'{x}{y}2', p):
                print(int(f'{y}{x}', p))
'''
# Показать ответ: 23


# № 5895 (Уровень: Сложный)
# (А. Игнатюк) Дано арифметическое выражение 5xyC_16 + 8xx7_y.
# Определите, сколько различных значений может принимать выражение при всех возможных x и y.
'''
ALPHABET = sorted('0123456789QWERTYUIOPASDFGHJKLXZXCVBNM')
my_set = set()
for y in range(9, 16):
    for x in ALPHABET[:y]:
        A = int(f'5{x}{y}C', 16)
        B = int(f'8{x}{x}7', y)
        my_set.add(A+B)
print(len(my_set))
'''
# Показать ответ: 84


# endregion Урок: ******************************************************************************


# todo:    Дмитрий   = [1, 2, 3, 4, 5+, 6, 7, 8+, 9.1, 10, 11, 12, 13, 14+, 15+, 16+, 17, 18, 19-21, 22, 23, 24, 25.2]
# todo: Дмитрий КЕГЭ = [5, 14, 16, 25]
# на прошлом уроке:
# на следующем уроке:  # todo: Тип 26 №  55822, Тип 26 № 48474 |
