
# region Домашка: ******************************************************************************

# 33188
'''
def F(n):
    if n == 0:
        return 0
    if (n % 3 == 0) and (n > 0):
        return n + F(n - 3)
    if n % 3 > 0:
        return n + F(n - (n % 3))
print(F(22))

# 106
'''

# 35990
'''
count = 0
def F(n):
    if n == 0:
        return 0
    if (n > 0) and (n % 2 == 0):
        return F(n / 2)
    if n % 2 != 0:
        return 1 + F(n - 1)
for n in range(1, 500+1):
    if F(n) == 3:
        count += 1
print(count)

# 84
'''

# K 6596
'''
def F(n):
    if n == 1:
        return 1
    if n > 1:
        return F(n - 1) * F(2 * n - 3)
print(F(516) / F(513))
F(516) = F(515) * F(2 * 516 - 3)
F(515) = F(514) * F(2 * 515 - 3)
F(514) = F(513) * F(2 * 514 - 3)
print((2*516-3)*(2*515-3)*(2*514-3))

# 1083202575
'''

# K 6088
'''
F(34) = F(35) - 33
F(35) = F(37) - 68
F(37) = F(39) - 72
print(-2*(-33 - 68 - 72))

# 346
'''

# K 5152
'''
print(2**10)

# 1024
'''

# 47227
'''
def F(a, b):
    if a > b or a == 17:
        return 0
    if a == b:
        return 1
    else:
        return F(a + 1, b) + F(a * 2, b)
print(F(1, 10) * F(10, 35))

# 98
'''

# 6997
'''
def F(a, b):
    if a > b:
        return 0
    if a == b:
        return 1
    else:
        return F(a + 1, b) + F(a * 2, b) + F(a * 2 + 1, b) + F(a * 10, b)
print(F(1, 15))

# 84
'''

# K 6635
'''
def F(a, b, count):
    if a < b:
        return 0
    if a == b or count == 13:
        return 1
    if a > b:
        return F(a - 3, b, count+1) + F(a * 3, b, count+1)
print(F(333, 0, 0))
'''

# K 4333
'''
def F(a, b):
    if a >= b or a == 6:
        return a == b
    if a == b:
        return 1
    if a < b:
        return F(a + 1, b) + F(a + 3, b) + F(a**2, b)
print(F(1, 5) * F(5, 25))
'''

# endregion Домашка: ******************************************************************************


# region Урок: ******************************************************************************

# 3.  КЕГЭ № 6635 Пробник ИМЦ СПб (Уровень: Средний)
# Исполнитель Троечка преобразует число, записанное на доске. У Троечки есть две команды:
#
# – Вычесть 3
# – Умножить на -3
#
# Сколько различных отрицательных результатов можно получить из исходного числа 333
# в ходе исполнения программы, содержащей ровно 13 команд?
'''
M = set() # Сколько различных
def F(a, h):
    if h == 13:
        M.add(a)
    else:
        F(a-3, h+1)
        F(a*(-3), h+1)

F(333, 0)
print(len([i for i in M if i < 0]))
'''
# Ответ: 2224



# endregion Урок: ******************************************************************************


# todo: Дмитрий = [1, 2, 3, 4, 5, 6, 8, 9.1, 12, 13, 14+, 15+, 16, 17, 18, 19-21, 22, 23, 24, 25.2]
# на прошлом уроке: Освежили в памяти решение 18 номер на столбец, разобрали 4 номер и 13 номер.
# на следующем уроке:
