
# region Домашка: ******************************************************************************

# endregion Домашка: ******************************************************************************


# region Урок: ******************************************************************************

import useful
print(help(useful.MyConvert))



# endregion Урок: ******************************************************************************


# todo:    Дмитрий   = [1, 2, 3, 4, 5+, 6, 7, 8+, 9.1, 11, 12, 13, 14+, 15+, 16+, 17, 18, 19-21, 22, 23, 24, 25.2]
# todo: Дмитрий КЕГЭ = [5, 14, 16, 25]
# на прошлом уроке: Рассмотрели номера с домашних вариантов и продолжили решать Якунина: 14, 15 номера
# на следующем уроке: #ДЗ 17, 22, 23, 15 &, 24, 25
