# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# Тип 8 № 3518 i
# Все 4-буквенные слова, составленные из букв М, А, Р, Т, записаны в алфавитном порядке.
# Вот начало списка:
# 1.АААА
# 2.АААМ
# 3.АААР
# 4.АААТ
# 5.ААМА

# Запишите слово, которое стоит на 250-м месте от начала списка.
'''
s = 'АМРТ'
S = sorted([i for i in 'МАРТ'])
k = 1
for a in S:
    for b in S:
        for c in S:
            for d in S:
                temp = a + b + c + d
                if k == 250:
                    print(k, temp)
                k += 1    # k = k + 1
'''
# Ответ: ТТРМ



# Тип 8 № 28685 i
# Петя составляет 6-буквенные коды из букв П, Е, Т, Я.
# Каждую букву можно использовать любое количество раз или совсем не использовать,
# при этом нельзя ставить подряд две гласные или две согласные.
# Сколько различных кодов может составить Петя?
'''
S = 'ПЕТЯ'
s1 = 'ПТ'
s2 = 'ЕЯ'
count = 0
for a in s1:
    for b in s2:
        for c in s1:
            for d in s2:
                for e in s1:
                    for f in s2:
                        count += 1
print(count*2)
'''
# Ответ: 128


print(14 & 5)

def Conc(m, n):
    M = bin(m)[2:]
    N = bin(n)[2:]

    while len(M) != len(N):
        if len(M) < len(N):
            M = '0' + M
        else:
            N = '0' + N
    print(M, N)

    R = ''
    for i in range(0, len(M)):
        if M[i] == '1' and N[i] == '1':
            R += '1'
        else:
            R += '0'

    r = int(R, 2)
    return r


print(Conc(14, 5))

# endregion Урок: ******************************************************************



# todo: Егор = []
# на прошлом уроке:
# на следующем уроке:
