# region Домашка: ************************************************************

# - это однострочный комментарий

''' - это многострочный комментарий
numbers = [5, 2, 3, 1, -5, 6, 7]
sorted1 = sorted(numbers)
"""
print('hello')
"""
sorted2 = numbers.sort()
print(sorted1 == sorted2)  # False
'''


'''
ctrl + A - выделить весь текст
ctrl + C - скопировать выделенный текст
ctrl + V - вставить текст из буфера обмена 
ctrl + X - вырезать и поместить в буфер обмена 
ctrl + Z - отменить последнее действие (шаг назад)
ctrl + F - открыть поиск по файлу 
ctrl + d - в Pycharm быстро дублировать строчку
'''


# input() - функция для ввода данных с клавиатуры в виде строки str()
# type() - функция, которая выводит тип данных переменной

# my_first_program.py
name = input('Введите имя: ')  # Пользователь вводит свое ФИО с клавиатуры
age = int(input('Введите возраст: '))  # Пользователь вводит свой возраст
# print(type(age))  # <class 'int'>
print(f'Здравствуйте, меня зовут {name}, мне {age} лет.')  # Через f-строки выводим сообщение с переменными name и age


'''
x = 25  # int
s = '25'  # str
print(x * 4)  # 100
print(s * 4)  # 25252525 - строчка при умножении на целое число дублируется

print(type(x))  # <class 'int'>
print(type(s))  # <class 'str'>
print(type(4.2))  # <class 'float'>
print(type(7 / 2))  # <class 'float'>
'''

# endregion Домашка: *********************************************************


# region Урок: ************************************************************


# endregion Урок: ************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************

# Герман = []
# КЕГЭ = []
# на следующем уроке:
