# region Домашка: ************************************************************


# endregion Домашка: *********************************************************


# region Урок: ************************************************************



'''
# i   0    1    2    3    4
L = ['a', 'b', 'c', 'd', 'e']

print(L[2])   # c

L.remove('c')   # - удаляет элемент по значению
print(L)  # ['a', 'b', 'd', 'e']

# x = L.pop(2)  # - забирает элемент по индексу
# print(x)  # c
# print(L)  # ['a', 'b', 'd', 'e']

# del L[2]  # - удаляет элемент списка по индексу
# print(L)  # ['a', 'b', 'd', 'e']
'''

'''
print("Hello" + "World")  # HelloWorld
print("Hello " + "World")  # Hello World
'''

'''
print(4 // 2)  # 2
print(4 / 2)  # 2.0
'''

'''
print(len("Hello"))  # 5
print(len("Hello "))  # 6
'''

'''
print(5 > 3)  # True
print(2 < 1)  # False
print(True and False)  # False
print(5 > 3 and 2 < 1)
'''

x = 28 // (23 % 5)
y = 27 % x * 3 - 30 % 4 * 2
print(x + y)

# endregion Урок: ************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************

# Герман = []
# КЕГЭ = []
# на следующем уроке:
