# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

'''
print([int(input()) ** 3 for x in range(int(input()))])
'''


'''
M = [1, 2, 3, 32, 43, 4, 12, 32, 13, 12, 23, 12, 312]

for i in range(len(M)):
    if M[i] % 2 == 0:
        M[i] = M[i] ** 2
print(M)
'''

'''
for i in range(len(M)):
    if M[i] % 2 == 0:
        print(M[i], end=' ')
'''

'''
for x in M:
    if x % 2 == 0:
        print(x, end=' ')
'''
'''
s = 'bcd+a++*++**31415'
print(s.count('+'))
print(f'Символ * встречается {s.count("*")} раз')
'''

# На вход программе подается одна строка.
# Напишите программу, которая выводит:
#
# общее количество символов в строке;
# исходную строку, повторенную 3 раза;
# первый символ строки;
# первые три символа строки;
# последние три символа строки;
# строку в обратном порядке;
# строку с удаленным первым и последним символом.
'''
s = input()
print(len(s))
print(s * 3)
print(s[0])
print(s[:4])
print(s[-3:])
print(s[::-1])
print(s[1:-1])
'''

# № 1751 Danov2102 (Уровень: Сложный) (А. Богданов)
# Исполнитель Редактор получает на вход строку цифр и преобразовывает её.
#
# Определите максимально возможное количество цифр 0, которое может получиться
# в результате применения представленного ниже алгоритма к строке, состоящей
# из 19 цифр 0, 13 цифр 1 и 17 цифр 2, идущих в произвольном порядке.

# ПОКА нашлось(10) ИЛИ нашлось(20)
#    ЕСЛИ нашлось(20)
#       ТО заменить(20, 00)
#    ИНАЧЕ заменить(10, 200)
'''
from itertools import permutations
R = []
M = ['0' * 19, '1' * 13, '2' * 17]
for elem in permutations(M):
    s = ''.join(elem)

    while '10' in s or '20' in s:  # ПОКА нашлось(10) ИЛИ нашлось(20)
        if '20' in s:  # ЕСЛИ нашлось(20)
            s = s.replace('20', '00', 1)  # ТО заменить(20, 00)
        else:
            s = s.replace('10', '200', 1)  # ИНАЧЕ заменить(10, 200)
    R.append(s.count('0'))
print(max(R))
'''

from itertools import permutations
R = []
M = ['0' * 19, '1' * 13, '2' * 17]
for elem in permutations(M):
    s = ''.join(elem)
    while '10' in s or '20' in s:
        if '20' in s:
            s = s.replace('20', '00',1)
        else:
            s = s.replace('10', '200',1)
    R.append(s.count('0'))
print(max(R))


# endregion Урок: ******************************************************************


# Лиза = [2.1, 6.1, 12.1]
# КЕГЭ  = []
# на следующем уроке:
