# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# № 16378 ЕГКР 27.04.24 (Уровень: Базовый)
'''
maxi = 0
for n in range(4, 10000):
    # начинающаяся с цифры «8», а затем содержащая и n цифр «4» (3 < n < 10 000)
    s = '8' + '4' * n
    while '11' in s or '444' in s or '8888' in s:
        if '11' in s:
            s = s.replace('11', '4', 1)
        if '444' in s:
            s = s.replace('444', '88', 1)
        if '8888' in s:
            s = s.replace('8888', '1', 1)
    summa = sum(map(int, s))
    maxi = max(maxi, summa)
print(maxi)
'''


# № 16323 Открытый вариант 2024 (Уровень: Базовый)
'''
s = '8' * 88
while '1111' in s or '8888' in s:
    if '1111' in s:
        s = s.replace('1111', '8', 1)
    else:
        s = s.replace('8888', '11', 1)
print(s)
'''
# Ответ: 11


# № 12921 PRO100 ЕГЭ 26.01.24 (Уровень: Базовый)
'''
for n in range(4, 10000):
    s = '5' + '2' * n
    while '52' in s or '2222' in s or '1122' in s:
        if '52' in s:
            s = s.replace('52', '11', 1)
        if '2222' in s:
            s = s.replace('2222', '5', 1)
        if '1122' in s:
            s = s.replace('1122', '25', 1)
    summa = sum(map(int, s))
    if summa % 10 == 7:
        print(n)
        break
'''

# № 16374 ЕГКР 27.04.24 (Уровень: Базовый)
# Сколько существует семизначных семеричных чисел,
# которые содержат в своей записи ровно две чётные цифры?
'''
s = '0123456'
cnt = 0
for a in s:
    for b in s:
        for c in s:
            for d in s:
                for e in s:
                    for f in s:
                        for g in s:
                            num = a + b + c + d + e + f + g
                            if a != '0':
                                chet = [x for x in num if x in '0246']
                                if len(chet) == 2:
                                    cnt += 1
print(cnt)
'''


# № 12917 PRO100 ЕГЭ 26.01.24 (Уровень: Базовый)
# Петя составляет слова путём перестановки букв в слове ПРОСТО.
# Сколько он сможет составить слов, если запрещено ставить рядом две одинаковые буквы?
'''
from itertools import *
R = []
for s in permutations('ПРОСТО'):
    s = ''.join(s)
    if 'ОО' not in s:
        R.append(s)
print(len(set(R)))
'''

#
# № 12786 Открытый курс "Слово пацана" (Уровень: Базовый)
# (М. Попков) Какое количество 6-буквенных слов вы сможете
# составить перестановкой букв слова «МАКАКА»?
# В данной задаче нужно принять подходящими все возможные последовательности,
# вне зависимости имеет или нет данный набор букв смысловое содержание.
# При этом необходимо избегать слов с двумя подряд одинаковыми буквами.
'''
from itertools import *
R = []
for s in permutations('МАКАКА'):
    s = ''.join(s)
    if 'АА' not in s and 'КК' not in s:
        R.append(s)
print(len(set(R)))
'''


# № 13823 (Уровень: Базовый)
'''
s = sorted('МИЗАНТРОП')
num = 0
for a in s:
    for b in s:
        for c in s:
            for d in s:
                for e in s:
                    slovo = a + b + c + d + e
                    num += 1
                    if num % 2 == 0:
                        if a == 'Н':
                            if slovo.count('Р') == 2:
                                print(num, slovo)
'''
# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************


# Лиза = [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 22, 23, 24, 25]
# КЕГЭ  = [1, 4, 7, 8, 12, 15, 16, 23]
# на следующем уроке:
