# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# 231.32.255.131
# IP адрес - это четыре числа раздленные точкой, на каждое число выделено по 1 байту (по 8 бит)
# Каждое такое число может лежать в диапазоне от 0 до 255 (11111111)

# Адрес сети = IP адрес узла & Маска сети, где & - побитовая конъюнкция

# Маска сети: Имеет дли ну 32 бита и вид: 11111..0000


# Тип 13 №4983
# По заданным IP-адресу узла и маске определите адрес сети.
# IP –адрес узла: 224.37.249.32
# Маска: 255.255.224.0
'''
from ipaddress import *
net = ip_network('224.37.249.32/255.255.224.0', 0)
print(net)   # 224.37.224.0/19, где 19 - кол-во единиц в маске сети
print(net.netmask)  # 255.255.224.0
print(f'{net.netmask:b}')  # 11111111111111111110000000000000
'''
# Ответ: DEDH


# Тип 13 №13542
# Для узла с IP-адресом 136.128.196.48 адрес сети равен 136.128.192.0.
# Чему равно наибольшее возможное значение третьего слева байта маски?
# Ответ запишите в виде десятичного числа.
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'136.128.196.48/{mask}', 0)
    print(net, net.netmask)
    # 136.128.192.0/18 255.255.192.0
    # 136.128.192.0/19 255.255.224.0
    # 136.128.192.0/20 255.255.240.0
    # 136.128.192.0/21 255.255.248.0
'''
'''
from ipaddress import *
maxi = 0
for mask in range(32+1):
    net = ip_network(f'136.128.196.48/{mask}', 0)
    if str(net) == f'136.128.192.0/{mask}':
        maxi = max(maxi, int(str(net.netmask).split('.')[2]))
print(maxi)
'''


# Тип 13 №27541
# Для узла с IP-адресом 132.214.141.28 адрес сети равен 132.214.141.0.
# Укажите наибольшее возможное значение последнего (самого правого)
# байта маски этой сети.
# Ответ запишите в виде десятичного числа.
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'132.214.141.28/{mask}', 0)
    print(net, net.netmask)
    # 132.214.141.0/24 255.255.255.0
    # 132.214.141.0/25 255.255.255.128
    # 132.214.141.0/26 255.255.255.192
    # 132.214.141.0/27 255.255.255.224
'''
# Ответ: 224


# Тип 13 №13596
# Для узла с IP-адресом 93.138.70.47 адрес сети равен 93.138.64.0.
# Каково наименьшее возможное общее количество единиц во
# всех четырёх байтах маски?
# Ответ запишите в виде десятичного числа.
'''
from ipaddress import *
mini = 99999999
for mask in range(32+1):
    net = ip_network(f'93.138.70.47/{mask}', 0)
    if str(net) == f'93.138.64.0/{mask}':
        mini = min(mini, mask)
print(mini)
'''

# Тип 13 №64943
# Узлы с IP -адресами 202.3.20.24 и 202.3.27.11 находятся
# в одной сети. Укажите наименьшее возможное количество принадлежащих
# этой сети IP -адресов, в двоичной записи которых чётное число единиц.
'''
from ipaddress import *
mini = 999999
for mask in range(32+1):
    net1 = ip_network(f'202.3.20.24/{mask}', 0)
    net2 = ip_network(f'202.3.27.11/{mask}', 0)
    if net1 == net2:
        cnt = 0
        for ip in net1:
            b = f'{ip:b}'
            if b.count('1') % 2 == 0:
                cnt += 1
        mini = min(mini, cnt)
        print(mini)
print(mini)
'''


# Тип 13 №18493
# Узлы с IP-адресами 98.162.71.151 и 98.162.71.155 находятся в одной сети.
# Чему равно наибольшее количество возможных единиц в маске этой сети?
'''
from ipaddress import *
maxi = 0
for mask in range(32+1):
    net1 = ip_network(f'98.162.71.151/{mask}', 0)
    net2 = ip_network(f'98.162.71.155/{mask}', 0)
    if net1 == net2:
        maxi = max(maxi, mask)
print(maxi)
'''


# Тип 13 №6009
# По заданным IP-адресу узла и маске определите адрес сети.
# IP-адрес узла: 64.128.208.194
# Маска: 255.255.224.0
'''
from ipaddress import *
net = ip_network('64.128.208.194/255.255.224.0', 0)
print(net)  # 64.128.192.0/19
'''


# Тип 13 №16815
# Для узла с IP-адресом 98.162.71.94 адрес сети равен 98.162.71.64.
# Чему равно наибольшее количество возможных адресов в этой сети?
'''
from ipaddress import *
maxi = 0
for mask in range(32+1):
    net = ip_network(f'98.162.71.94/{mask}', 0)
    if str(net) == f'98.162.71.64/{mask}':
        maxi = max(maxi, net.num_addresses)
print(maxi)
'''


# № 15326 Досрочная волна 2024 (Уровень: Базовый)
# Сеть задана IP-адресом 105.224.200.224 и сетевой маской 255.255.255.224.
# Сколько в этой сети IP-адресов, для которых количество единиц
# в двоичной записи IP-адреса кратно 4?
# В ответе укажите только число.

from ipaddress import *
net = ip_network('105.224.200.224/255.255.255.224', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('1') % 4 == 0:
        cnt += 1
print(cnt)



# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************


# Лиза = [1, 2, 3, 4, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 22, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:
