# Домашка
"""


a = int(input("Введите число a:"))
b = int(input("Введите число b:"))
print("Квадрат суммы" , a , " и ", b , "равен", (a + b)**2 )
print("Сумма квадратов" , a , " и ", b , "равна", (a**2) + (b**2))

"""


"""
x = input()
print('Цифра в позиции тысяч равна', x[0])
print('Цифра в позиции сотен равна', x[1])
print('Цифра в позиции десятков равна',x[2])
print('Цифра в позиции единиц равна', x[3])

"""

"""
a = int(input())
b = int(input())
print(a, "мин - это", a // 60, "час", a % 60, "минут", "и" , b, "мин - это", b // 60, "час", b % 60, "минут.")
"""