# region Домашка:  ******************************************************************************



# endregion Домашка: ******************************************************************************


# region Урок:  ******************************************************************************



# Тип 15 № 8106 i
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».
# Для какого наибольшего натурального числа А формула
# ¬ДЕЛ(x, А) → (ДЕЛ(x, 6) → ¬ДЕЛ(x, 4))
# тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной x)?
'''
# Вариант 1
def F(x, A):
    return (x % A != 0) <= ((x % 6 == 0) <= (x % 4 != 0))

for A in range(1, 10000):
    flag = True
    for x in range(1, 1000):
        if F(x, A) == False:
            flag = False
            break
    if flag == True:
        print(A)

# Вариант 2
def F(x):
    return (x % A != 0) <= ((x % 6 == 0) <= (x % 4 != 0))

for A in range(1, 10000):
    if all(F(x) for x in range(1, 1000)):
        print(A)


# Вариант 3
def F(x):
    return (x % A != 0) <= ((x % 6 == 0) <= (x % 4 != 0))

for A in range(10000, 1-1, -1):
    if all(F(x) for x in range(1, 1000)):
        print(A)
        break


# Вариант 4
def F(x):
    return (x % A != 0) <= ((x % 6 == 0) <= (x % 4 != 0))

R = []
for A in range(10000, 1-1, -1):
    if all(F(x) for x in range(1, 1000)):
        R.append(A)
print(max(R))

# Вариант 5
print(max([A for A in range(1, 1000) if all(((x % A != 0) <= ((x % 6 == 0) <= (x % 4 != 0))) for x in range(1, 1000))]))
'''
# Ответ: 12

#  (w→y) ∧ (¬y ≡ x) ∧ (x ∨ z)
# Правила оформления логических дествий в Python
#  ¬y     --->  (not y)   инверсия (отрицание)
# x ∧ y   --->  x and y   конъюнкция (логическое умножение)
# x ∨ y   --->  x or y    дизъюнкция (логическое сложение)
# x → y   --->  x <= y    имполикация --->  (not x) or y
# x ≡ y   --->  x == y    тождество


# Тип 15 № 27017 i
# Для какого наибольшего целого неотрицательного числа А выражение
#
# (x·y < 100) ∨ (y ≥ A) ∨ (x > A)
# тождественно истинно, т.е. принимает значение 1 при любых целых неотрицательных x и y?
'''
def F(x, y):
    return (x*y < 100) or (y >= A) or (x > A)

for A in range(1, 10000):
    if all(F(x, y) for x in range(1, 100) for y in range(1, 100)):
        print(A)
'''
# Ответ: 10


# Тип 15 № 34539 i
# На числовой прямой даны два отрезка: Р = [22, 72] и Q = [42, 102].
# Какова наименьшая возможная длина интервала A, что логическое выражение
# ¬(¬(х ∈ А) ∧ (х ∈ Р)) ∨ (х ∈ Q)
# тождественно истинно, то есть принимает значение 1 при любом значении переменной х.

def F(x):
    P = 22 <= x <= 72
    Q = 42 <= x <= 102
    A = a1 <= x <= a2
    return not((not A) and P) or Q

R = []
M = [i/4 for i in range(20*4, 110*4)]
for a1 in M:
    for a2 in M:
        if all(F(x) for x in M):
            R.append(a2-a1)
print(min(R))

# Ответ: 20

# endregion Урок:  ******************************************************************************


# todo: Ислам = [2, 5, 6, 8, 12, 14+, 15, 16.2, 23]
# на прошлом уроке: Снова повторяли 15 номера, Ислам решал сам вторую половину урока.
# на следующем уроке: