# region Домашка: ******************************************************************************


# endregion Домашка: ******************************************************************************


# region Урок: ******************************************************************************
'''
s = sorted('ПЯТНИЦА')
k = 1
count = 0
for a in s:
    for b in s:
        for c in s:
            for d in s:
                for e in s:
                    for f in s:
                        slovo = a + b + c + d + e + f
                        if a != 'Ц' and slovo.count('И') == 2:
                            if k % 2 != 0:
                                count += 1
                                print(k, slovo)
                        k += 1
print(count)

'''


# Сколько существует шестизначных чисел, делящихся на 5,
# в которых каждая цифра может встречаться только один раз,
# при этом никакие две чётные и две нечётные цифры не стоят рядом.
'''
from itertools import *
count = set()
for s in product('0123456789', repeat=6):
    num = ''.join(s)
    if num[0] != '0' and num[-1] in '05':
        if all(int(num[i]) % 2 != int(num[i+1]) % 2  for i in range(0, len(num)-1)):
            count.add(num)
print(len(count))
'''






# endregion Урок: ******************************************************************************


# todo: Иван = [2, 3, 6, 7, 8, 10, 11, 12, 13, 14+, 15+, 16, 17, 19-21, 23]
# на прошлом уроке: Прорешали два вопроса по 5 номеру и разобрали 25 номера с новым решением через fnmatch
# на следующем уроке: