# region Домашка: ******************************************************************************


# endregion Домашка: ******************************************************************************


# region Урок: ******************************************************************************


# 1 (x ∨ y) ∧ ¬(y ≡ z) ∧ ¬w
# 2 ((x → y ) ≡ (z → w)) ∨ (x ∧ w)
# 3 ((x ∧ y) ∨ (y ∧ z)) ≡ ((x → w) ∧ (w → z))
# 4 ((x ∧ w) ∨ (w ∧ z)) ≡ ((z → y) ∧ (y → x))
# 5 (w → x) ∧ ((y → z) ≡ (x → y))
# 6 (x→y) ∧ (y ≡ ¬z) ∧ (z ∨ w)
# 7  ((x → y) ∨ (y ≡ w))∧((x∨z) ≡ w)
# 8 (x ≡ ( w ∨ y)) ∨ ((w → z ) ∧ (y → w))
# 9 (¬x ∨ y ∨ z) ≡ (¬y ∧ z ∧ w)

'''
print('x y z w F')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                F = (((not(x)) or y or z) == ((not(y)) and z and w))
                if F == True:
                    print(x, y, z, w, F)
'''

# endregion Урок: ******************************************************************************


# todo: Иван = [2, 5, 8, 12, 13, 14, 15, 16, 17, 23], на следующем уроке: Добиваем 2, 4 номера и разбираем 13, 14, 5

