# region Домашка: ******************************************************************************


# endregion Домашка: ******************************************************************************


# region Урок: ******************************************************************************


# endregion Урок: ******************************************************************************


# todo: Иван = [2, 6, 8, 10, 12, 13, 14+, 15+, 16, 17, 23]
# на прошлом уроке: Прорешивали 19-21 задачи на теорию игр с одной кучей
# на следующем уроке: Точно нужно повторить 8 номер, Повторить 15 номер, Разобраться немного с 7 номером