# region Домашка: ******************************************************************************


# endregion Домашка: ******************************************************************************


# region Урок: ******************************************************************************

'''
from turtle import *

l = 10
for _ in range(9):
    forward(18*l)
    right(72)
done()
'''

# № 159
'''
t = (5625 * 2**23) / (2*48000*24)
print(t / 60)
'''
# Ответ :


# N° 5230 (Уровень: Сложный)
# Алгоритм вычисления значения функции F(n, k), где п, к - натуральные числа, задан следующими соотношениями:

# F(n, k) = 0 при k = 0;
# F(n, k) = F(n, k - 1) + k*2 при k > 0 и n mod k = 0;
# F(n, k) = F(n, k - 1) при k > 0 и n mod k# 0.

# Чему равно значение функции F(11223456789, 123456789)?
# Примечание: то возвращает остаток от деления одного числа на другое нацело.
# Показать ответ: 7569616146557181
'''
n = 11223456789
k = 123456789
r = 0
while k > 0:
    if n % k == 0:
        r += k*2
        print(k, r)
    k -= 1
'''

'''
from functools import *
@lru_cache(None)
def F(n, k):
    if k == 0:
        return 0
    if k > 0 and n % k == 0:
        return F(n, k - 1) + k*2
    if k > 0 and n % k != 0:
        return F(n, k - 1)

print(F(11223456789, 123456789))
'''

# N 5291 dev/int 12.2022 ( Убовень» Безовый)
# Алгоритм вычисления значения функции Fin). гл n - натуральное число. задан следуюшими соотношениями
# F(n) = 1,  n < 3
# F(n) = F(n - 1) + n, если п > 2 и при этом п нечётно:
# F(n) = F(n - 3) + 2 × n, если п > 2 и при этом п чётно.
# Чему равно значение выражения F(2048) - F(2041)?

# F(2048) = F(2048 - 3) + 2 * 2048
# F(2045) = F(2045 - 1) + 2045
# F(2044) = F(2044 - 3) + 2 * 2044
# F(2041)   .... .. .. . .  - F(2041)
'''
print(2 * 2048 + 2045 + 2 * 2044)
'''
# Ответ: 10229


# Алгоритм вычисления значения функции F(n), где п - натуральное число, задан следующими соотношениями:
# F(1) = 2, при n == 1
# F(n) = F(n - 1) * ((3**(n%5)) / (3**(n%7)))

# Чему равно значение выражения F(1025) / F(1030)
# В ответе запишите только целое число.

# F(1030) = F(1030 - 1) * ((3**(1030%5)) / (3**(1030%7)))
# F(1029) = F(1029 - 1) * ((3**(1029%5)) / (3**(1029%7)))
# F(1028) = F(1028 - 1) * ((3**(1028%5)) / (3**(1028%7)))
# F(1027) = F(1027 - 1) * ((3**(1027%5)) / (3**(1027%7)))
# F(1026) = F(1026 - 1) * ((3**(1026%5)) / (3**(1026%7)))
# F(2025) . .. . . . . . / F(2025)
'''
r = ((3**(1030%5)) / (3**(1030%7))) * \
    ((3**(1029%5)) / (3**(1029%7))) * \
    ((3**(1028%5)) / (3**(1028%7))) * \
    ((3**(1027%5)) / (3**(1027%7))) * \
    ((3**(1026%5)) / (3**(1026%7)))

print(1 / 0.0013717421124828531)
'''
# Ответ: 729


# w°5727 (Уровень средний)
# (Д. Тараскин) Функция F(x, y) задается рекуррентным соотношением:
# F(x, 0) = x
# F(x, y) = F(y, x mod y)
# Для скольких чисел X в диапазоне [1:1000] функция F(x, 48) будет равна 1?
'''
def F(x, y):
    if y == 0:
        return x
    else:
        return F(y, x % y)

count = 0
for x in range(1, 1000+1):
    if F(x, 48) == 1:
        count += 1
print(count)
'''





# endregion Урок: ******************************************************************************


# todo: Иван = [2, 6, 8, 10, 12, 13, 14+, 15+, 16, 17, 23]
# на прошлом уроке: Прорешивали задачи с вопросами, в основном номера: 6, 16
# на следующем уроке: Теория игр 19-21 на две кучи