# region Домашка: ******************************************************************

# endregion Домашка: *****************************************************************


# region Урок: ******************************************************************

# Тип 15 №29203
# Для какого наименьшего целого неотрицательного числа А выражение
# (3x + 7y < A) ∨ (x ≥ y) ∨ (y > 6)
# тождественно истинно, т. е. принимает значение 1 при любых целых неотрицательных x и y?
'''
# Вариант 1
def F(x, y, A):
    return (3*x + 7*y < A) or (x >= y) or (y > 6)


for A in range(0, 1000):
    flag = True
    for x in range(0, 100):
        for y in range(0, 100):
            # if F(x, y, A) == False:
            if not F(x, y, A):
                flag = False
                break
    # if flag == True:
    if flag:
        print(A)
        break

# Вариант 2
for A in range(0, 300):
    k = 0
    for x in range(0, 300):
        for y in range(0, 300):
            if (3 * x + 7 * y < A) or (x >= y) or (y > 6):
                k += 1
    if k == 90_000:
        print(A)
        break

# Вариант 3
def F(x, y, A):
    return (3*x + 7*y < A) or (x >= y) or (y > 6)


for A in range(0, 1000):
    if all(F(x, y, A) for x in range(100) for y in range(100)):
        print(A)
        break


# Вариант 3.1
R = []
def F(x, y, A):
    return (3*x + 7*y < A) or (x >= y) or (y > 6)


for A in range(0, 1000):
    if all(F(x, y, A) for x in range(100) for y in range(100)):
        R.append(A)
print(min(R))


# Вариант 4
print(min([A for A in range(0, 1000) if all(((3*x + 7*y < A) or (x >= y) or (y > 6)) for x in range(100) for y in range(100))]))
'''
# Ответ: 58


# Тип 15 №48463
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».
# Укажите наименьшее целое значение A, для которого формула
# (ДЕЛ(72,x)→¬ДЕЛ(90,x))∨(A−x>80)
# тождественно истинна при любом натуральном значении переменной x.
'''
def F(x, A):
    return ((72 % x == 0) <= (90 % x != 0)) or (A-x > 80)


for A in range(0, 1000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
        break
 '''
# Ответ: 99


# Тип 15 №34519
# Обозначим через m&n поразрядную конъюнкцию неотрицательных целых чисел m и n.
# Для какого наименьшего неотрицательного целого числа А формула
# x&9 = 0 → (x&19 ≠ 0 → x&А ≠ 0)
# тождественно истинна (т. е. принимает значение 1 при любом
# неотрицательном целом значении переменной х)?
'''
def F(x, A):
    return (x&9 == 0) <= ((x&19 != 0) <= (x&A != 0))

for A in range(0, 1000):
    if all(F(x, A) for x in range(0, 10000)):
        print(A)
        break
'''
# Ответ: 18


# Тип 15 №47012
# На числовой прямой даны два отрезка: P=[69;91] и Q=[77;114].
# Укажите наименьшую возможную длину такого отрезка A, для которого формула
# (x∈P)→(¬((x∈P)≡(x∈Q))∨((x∈Q)→(x∈A)))
# тождественно истинна (т.е. принимает значение 1 при любом значении переменной х).
'''
def F(x, a1, a2):
    P = 69 <= x <= 91
    Q = 77 <= x <= 114
    A = a1 <= x <= a2
    # return (69 <= x <= 91) <= ((not((69 <= x <= 91)) == (77 <= x <= 114))) or ((77 <= x <= 114) <= (a1 <= x <= a2)))
    return P <= ((not(P == Q)) or (Q <= A))


R = []
M = [x/4 for x in range(60*4, 120*4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2-a1)
print(min(R))
'''
# Ответ: 14.0 -> 14



# Тип 15 №34543
# На числовой прямой даны два отрезка: P = [3, 13] и Q = [12, 22].
# Какова наибольшая возможная длина интервала A, что формула
# ((х ∈ A) → (х ∈ Р)) ∨ (х ∈ Q)
# тождественно истинна, то есть принимает значение 1 при любом значении переменной х.
'''
def F(x, a1, a2):
    P = 3 <= x <= 13
    Q = 12 <= x <= 22
    A = a1 <= x <= a2
    return (A <= P) or Q


R = []
M = [x/4 for x in range(0*4, 25*4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2-a1)
print(max(R))
'''
# Ответ: 19.0 -> 19


# Тип 15 №58523
# На числовой прямой даны три отрезка: P=[13;31], Q[18;80] и R=[48;114].
# Укажите наименьшую возможную длину такого отрезка A, для которого формула
# ¬((x∈Q)→((x∈P)∨(x∈R)))→(¬(x∈A)→¬(x∈Q))
# тождественно истинна (т.е. принимает значение 1 при любом значении переменной х).
'''
def F(x, a1, a2):
    P = 13 <= x <= 31
    Q = 18 <= x <= 80
    R = 48 <= x <= 114
    A = a1 <= x <= a2
    return (not(Q <= (P or R))) <= ((not A) <= (not Q))


R = []
M = [x/10 for x in range(10*10, 120*10)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2-a1)
print(min(R))
'''
# Ответ: 16.5 -> 16.599 -> 16.799 -> 17


# Тип 15 №59755

# Для какого наибольшего целого неотрицательного числа А выражение
# (x<A)∨(y<A)∨(y<x−1)∨(y<2x−3)
# тождественно истинно?

def F(x, y, A):
    return (x<A) or (y<A) or (y<(x-1)) or (y<(2*x-3))

for A in range(0, 1000):
    if all(F(x, y, A) for x in range(300) for y in range(300)):
        print(A)
        break

for a in range(0, 300):
    k = 0
    for x in range(0, 300):
        for y in range(0, 300):
            if (x < a) or (y < a) or (y < x-1) or (y < 2*x-3):
                k += 1
    if k == 90_000:
        print(a)
        break

# endregion Урок: ******************************************************************


# Екатерина = [2.1, 5.1, 6.1, 12.1, 14.1, 15.1, 16.1, 23.1]
# КЕГЭ  = []
# на следующем уроке:
