# region Домашка:  **************************************************


# endregion Домашка: **************************************************




# region Урок:  **************************************************




# endregion Урок:  **************************************************


# todo: Кирилл = [1, 2, 4, 5, 8, 12, 13, 14+], на следующем уроке:
# на прошлом уроке: Повторили 8 номер, разбирали 1, 4, 13 номера для пробника в школе.
# на следующем уроке: Как прошел пробник? Отвечаем на вопросы. Переходим к 16, 23 номера и теории функций
