# region Домашка:  **************************************************


# endregion Домашка: **************************************************


# region Урок:  **************************************************

# № 6737 Апробация 10.03.23 (Уровень: Базовый)
# Миша заполнял таблицу истинности логической функции F = (x → ¬ (y → z)) ∨ w, но успел заполнить лишь фрагмент
# из трёх различных её строк, даже не указав, какому столбцу таблицы соответствует каждая из переменных w, x, y, z.
'''
print('x y z w')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                F = (x <= (not(y <= z))) or w
                if F == False:
                    print(x, y, z, w)
'''

# region Тип 2 № 17366
# Логическая функция F задаётся выражением ((x ∧ w) ∨ (w ∧ z)) ≡ ((z → y) ∧ (y → x)).
'''
print('x y z w F')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                F = ( ((x and w) or (w and z)) == ((z <= y) and (y <= x)) )
                if F == True:
                    print(x, y, z, w, F)
'''
'''
print('x y z w')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                F = (((not(z)) or w) and ((not(x)) == y)) <= (x and z)
                if not(F):
                    print(x, y, z, w, F)
'''
# endregion Урок:  **************************************************


# todo: Кирилл = [1, 2, 3, 4, 5, 8, 12, 13, 14+, 15, 16, 22, 23, 25.1], на следующем уроке:
# на прошлом уроке: Прорешивали 2 номер и отвечал на вопросы, помогал разобраться с номерами: 2, 22, 23
# на следующем уроке:
