# region Домашка: ***************************************************************

# endregion Домашка: ************************************************************


# region Урок: ******************************************************************
'''
print('x y z w')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                print(x, y, z, w)
'''

# Тип 2 № 19051

# Миша заполнял таблицу истинности функции (x ∧ ¬y) ∨ (x ≡ z) ∨ ¬w,
# но успел заполнить лишь фрагмент из трёх различных её строк, даже не
# указав, какому столбцу таблицы соответствует каждая из переменных w, x, y, z.

# Приоритет операций: (not x) > (a and y) > (x or y) > (x <= y) > (x == y)

print('x y z w')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                # (x ∧ ¬y) ∨ (x ≡ z) ∨ ¬w   |   (x and (not y)) or (x == z) or (not w)
                # (w ∨ ¬x) ∧ (w ≡ ¬y) ∧ (w → z)   |   (w or (not x)) and (w == (not y)) and (w <= z)
                # (x∨¬y)∧ ¬(y≡z) ∧ ¬w   |   (x or (not y)) and (not(y == z)) and (not w)
                # (x → y) ∨ ¬(w → z)
                F = (x <= y) or (not(w <= z))
                if not F:
                    print(x, y, z, w)


# endregion Урок: ***************************************************************


# todo: Анастасия = [1.1, 2.1, 3.1, 4.1, 5.1, 7.1, 11.1, 12.1, 13.1, 14.1]
# todo:  КЕГЭ  = []
# на прошлом уроке:
# на следующем уроке:
