# region Домашка: ***************************************************************


# endregion Домашка: ************************************************************


# region Урок: ******************************************************************

# Ввели число трехзнчное (int) нужно разбить его на цифры
# и вывести на экран сумму цифр и произвидение этих цифр
# Пример: 567  Сумма: 5+6+7 = 18, Произведение 5*6*7

num = int(input('Введите трехзначное число: '))
a = num // 100
b = (num // 10) % 10
c = num % 10
print(f'Сумма цифр числа {num}: {a+b+c}')
print(f'Произведение цифр числа {num}: {a*b*c}')


# Ввели число пятизначное (int) нужно разбить его на цифры
# и вывести на экран сумму цифр и произвидение этих цифр
# Пример: 56785  Сумма: 5+6+7+8+5 = 18, Произведение 5*6*7*8*5

num = int(input('Введите трехзначное число: '))
a = num // 100
b = (num // 10) % 10
c = num % 10
print(f'Сумма цифр числа {num}: {a+b+c}')
print(f'Произведение цифр числа {num}: {a*b*c}')

# endregion Урок: ***************************************************************


# todo: Анастасия = [1.1, 2.1, 3.1, 4.1, 5.1, 7.1, 11.1, 12.1, 13.1, 14.1]
# todo:  КЕГЭ  = []
# на прошлом уроке:
# на следующем уроке:
