# region Домашка: ************************************************************


# endregion Домашка: ************************************************************

# region Урок: ************************************************************

# Тип 15 №59840
"""
import time
start = time.time()

# Вариант 1
'''
m = []
k = 0
for A in range(0, 1000):
    k = 0
    for x in range(0, 100):
        for y in range(0, 100):
            if (48 != y + 2 * x) or (A < x) or (A < y):
                k += 1
    if k == 10000:
        m.append(A)
print(max(m))
'''
# Время исполнения: 0.7884418964385


# Вариант 2
'''
R = []
for a in range(0, 1000):
    a_pod = True
    for x in range(0, 100):
        for y in range(0, 100):
            if ((48 != y + 2 * x) or (a < x) or (a < y)) == False:
                a_pod = False
                break
        if a_pod == False:
            break
    if a_pod == True:
        R.append(a)
print(max(R))
'''
# Время исполнения: 0.017053842


# Вариант 3
'''
R = []
for A in range(0, 1000):
    if all(((48 != y + 2 * x) or (A < x) or (A < y)) for x in range(0, 100) for y in range(0, 100)):
        R.append(A)
print(max(R))
'''
# Время исполнения: 0.0098650

# Вариант 4.1
'''
def F(x, y, A):
    return (48 != y + 2 * x) or (A < x) or (A < y)

R = []
for A in range(0, 1000):
    if all(F(x, y, A) for x in range(0, 100) for y in range(0, 100)):
        R.append(A)
print(max(R))
'''
# Время исполнения: 0.01834

# Вариант 4.2
'''
print(max([A for A in range(0, 1000) if all(((48 != y + 2 * x) or (A < x) or (A < y)) for x in range(0, 100) for y in range(0, 100))]))
'''
# Время исполнения: 0.0100710

print(time.time() - start)
"""

# Тип 15 №34518
# Для какого наибольшего целого числа А формула
# х&А → (x&36 = 0 → х&6)
# тождественно истинна (т. е. принимает значение 1 при любом неотрицательном целом значении переменной x)?
'''
def F(x, A):
    return (x & A != 0) <= ((x & 36 == 0) <= (x & 6 != 0))


R = []
for A in range(0, 1000):
    if all(F(x, A) for x in range(10000)):
        R.append(A)
print(max(R))
'''


# Тип 15 №34535
# На числовой прямой даны три отрезка: P = [10, 40], Q = [5, 15] и R = [35, 50].
# Какова наименьшая возможная длина промежутка A, что формула
#
# ( (x ∈ А) ∨ (x ∈ P) ) ∨ ((x ∈ Q)→ (x ∈ R))
#
# тождественно истинна, то есть принимает значение 1 при любом значении переменной х.
'''
def F(x, a1, a2):
     P = 10 <= x <= 40   # P = [10, 40]  (x ∈ P)
     Q = 5 <= x <= 15
     R = 35 <= x <= 50
     A = a1 <= x <= a2
     return (A or P) or (Q <= R)


R = []
M = [x / 10 for x in range(5 * 10, 50 * 10)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(min(R))
'''
# Ответ: 4.75 -> 4.8000 -> 4.9 -> 5

# 2 (40731)
'''
p = [x for x in range(19,85)]
q = [x for x in range(4,52)]
a = []
for x in range(0,100):
    if ((x in q) <= ((not(x in p)) <= (not(x in q) and (not(x in a))))) == False:
            a.append(x)

print(max(a) - min(a) + 1)
'''


# Если маска подсети 255.255.248.0 и IP-адрес компьютера в сети 112.154.133.208,
# то номер компьютера в сети равен_____
'''
print(f'{248:b}'.zfill(8) + f'{0:b}'.zfill(8))
print(f'{133:b}'.zfill(8) + f'{208:b}'.zfill(8))
# 1111100000000000
# 1000010111010000

# 10111010000
print(int('10111010000', 2))
'''


# Тип 13 №2232

# Если маска подсети 255.255.255.192 и IP-адрес компьютера в сети 10.18.134.220,
# то номер компьютера в сети равен_____
'''
print(f'{255:b}'.zfill(8) + f'{192:b}'.zfill(8))
print(f'{134:b}'.zfill(8) + f'{220:b}'.zfill(8))
# 1111111111000000
# 1000011011011100

# 011100
print(int('011100', 2))
'''

# endregion Урок: ************************************************************


# region Разобрать: *************************************************************


# todo Подумать и разобрать (задача на компьютер в сети)
'''
from ipaddress import *
net = ip_network('10.18.134.220/255.255.255.192', 0)
print(net)  # 10.18.134.192
ip1 = ip_address('10.18.134.220')  # Адрес узла
ip2 = ip_address('10.18.134.192')  # Адрес сети
print(int(ip1) - int(ip2))
'''

# todo Разобрать  КЕГЭ #10789 (в ответах 4, у меня 5)
# Для узла с IP-адресом 203.75.227.102 адрес сети равен 203.75.224.0. Для скольких
# значений третьего слева байта маски допустим такой адрес сети?

'''
from ipaddress import *

for mask in range(16, 33):
    net = ip_network(f'203.75.227.102/{mask}', 0)
    for ip in net:
        print(ip, net.netmask)
'''

# маски получились (255.255.192/224/240/248/252.0)

# Проверка полученных масок
''' 
from ipaddress import *
net = ip_network('203.75.227.102/255.255.192.0', 0)
for x in net:
    print(x)
    break
'''

# todo Разобрать Тип 13 №64898
# Узлы с IP-адресами 114.91.57.39 и 114.91.19.61 находятся в одной сети.
# Укажите наименьшее возможное количество принадлежащих этой сети IP-адресов,
# в двоичной записи которых чётное число единиц.
'''
from ipaddress import *
R = []
for mask in range(32+1):
    net1 = ip_network(f'114.91.57.39/{mask}', 0)
    net2 = ip_network(f'114.91.19.61/{mask}', 0)
    if net1 == net2:
        cnt = 0
        for ip in net1:
            s = f'{ip:b}'
            if s.count('1') % 2 == 0:
                cnt += 1
        R.append(cnt)
print(min(R))
'''

# endregion Разобрать: *************************************************************


# Олеся = [1, 2, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21 (кодом), 24, 25]
# КЕГЭ = []
# на следующем уроке: Разбирали ли мы 15 номера? Решать сложные 14 номера
