# region Домашка: ************************************************************


# endregion Домашка: ************************************************************

# region Урок: ************************************************************

'''

8. 11616
9. 11617
13. 11791
14. 11622
18. 11626
23. 11629
24. 11630
25. 11718
'''

# 47230 Решу ЕГЭ
'''
f = open('26.txt')
N = int(f.readline())
M = sorted([int(x) for x in f])[::-1]
# M = sorted([int(x) for x in f], reverse=True)
BOX = [M.pop(0)]
for x in M:
    if x <= BOX[-1] - 3:
        BOX.append(x)
print(len(BOX), min(BOX))
'''

# 4629 КЕГЭ
'''
f = open('26.txt')
N = int(f.readline())
M = sorted([int(x) for x in f])
summa1 = sum(M) - sum(M[::-1][:2500]) * 0.5
summa2 = sum(M) - sum(M[:2500]) * 0.5
print(summa1, summa2)
'''

# endregion Урок: ************************************************************


# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************


# Олеся = [1, 2, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21 (кодом), 24, 25]
# КЕГЭ = []
# на следующем уроке:
