# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************

# Разобрать задачку Лев (если мы нашли *+ мы не выкидываем строку, а разбиваем ее) - done
# КЕГЭ № 6094 /dev/inf 02.2023 (Уровень: Средний) (А. Рогов)
# Текстовый файл состоит не более чем из 1 200 000 символов X, Y, и Z.
# Определите максимальное количество идущих подряд пар символов
# вида согласная + гласная среди которых нет подстроки XYZY.
# Примечание. Букву Y считайте всегда гласной.
'''
s = open('24.txt').readline()
s = s.replace('XY', '*').replace('ZY', '+')
for a in 'XYZ':
    s = s.replace(a, ' ')
s = s.replace('*+', '* +')
print(max([len(x) for x in s.split()]))
'''

# endregion Разобрать: *************************************************************


# Лев = [1, 2, 4, 5, 6, 7, 8, 9, 11, 12, 14, 15, 16, 17, 18, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:
