
# region Домашка: ************************************************************

# На вход программе подается последовательность целых чисел от 0 до 55, характеризующее оценку ученика,
# каждое число на отдельной строке. Концом последовательности является любое отрицательное число, либо число,
# большее 55. Напишите программу, которая выводит количество пятерок.
'''
count = 0
while True:
    x = int(input())
    if x == 5:
        count += 1
    if 0 > x or x > 55:
        break
print(count)
'''
# endregion Домашка: ************************************************************

# region Урок: ************************************************************

# Тип 2 №57409
# Миша заполнял таблицу истинности логической функции F:
# (x∨¬y)∧¬(y≡z)∧¬w
# F = (x or (not y)) and (not(y == z)) and (not w)
'''
print('x y z w F')
for x in range(2):  # [0, 1]
    for y in range(2):  # for y in [0, 1]:
        for z in range(2):
            for w in range(2):
                F = (x or (not y)) and (not (y == z)) and (not w)
                if F:
                    print(x, y, z, w, int(F))
'''

# Тип 2 №19051
#  (x ∧ ¬y) ∨ (x ≡ z) ∨ ¬w
'''
print('x y z w F')
for x in range(2):  # [0, 1]
    for y in range(2):  # for y in [0, 1]:
        for z in range(2):
            for w in range(2):
                F = (x and (not y)) or (x == z) or (not w)
                if not F:
                    print(x, y, z, w, int(F))
'''

# Тип 2 №18614
# Логическая функция F задаётся выражением ((w → ¬x) ≡ (z → y)) ∧ (y ∨ w).
#
# Дан частично заполненный фрагмент, содержащий неповторяющиеся строки
# таблицы истинности функции F.
'''
print('x y z w F')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                F = ((w <= (not x)) == (z <= y)) and (y or w)
                print(x, y, z, w, int(F))
'''
# endregion Урок: ************************************************************


# todo: Максим = []
# на прошлом уроке:
# на следующем уроке:
