
# region Домашка: ******************************************************************

# Век живи - век учись.
# 10
'''
s = 'Век живи - век учись.'
n = 10
for i in range(n):
    print(f'{i+1}. {s}')
'''

# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# Тип 2 №33174
# Логическая функция F задаётся выражением ((x → y) ≡ (w → x)) ∧ (z → w).
# На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки.
# Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.
'''
print('x y z w F')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                F = ((x <= y) == (w <= x)) and (z <= w)
                if F:
                    print(x, y, z, w, F)
'''

# Шаблон:
'''
print('x y z w F')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                F = pass
                if F == pass:
                    print(x, y, z, w, F)
'''

# Тип 2 №27371
# Логическая функция F задаётся выражением
# ((x ∧ ¬y) → (¬z ∨ ¬w)) ∧ ((w → x) ∨ y).
'''
print('x y z w F')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                F = ((x and (not y)) <= ((not z) or (not w))) and ((w <= x) or y)
                if (not F):
                    print(x, y, z, w, int(F))
'''


# Тип 2 №48423
# Логическая функция F задаётся выражением: (x → (y ≡ w)) ∧ (y ≡ (w → z))

print('x y z w F')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                F = (x <= (y == w)) and (y == (w <= z))
                print(x, y, z, w, int(F))

# endregion Урок: ******************************************************************


# todo: Марк = []
# todo: КЕГЭ  = []
# на прошлом уроке:
# на следующем уроке:
