
# region Домашка:  ************************************************************



# endregion Домашка: ************************************************************


# region Урок:  ************************************************************

# Тип 17 № 47221 Добавить в вариант
# В файле содержится последовательность целых чисел.
# Элементы последовательности могут принимать целые значения от −10000 до 10000 включительно.
# Определите количество пар последовательности, в которых только одно число оканчивается на 3,
# а сумма квадратов элементов пары не меньше квадрата максимального элемента последовательности, оканчивающегося на 3.
'''
A = [int(i) for i in open('17.txt') if int(i) % 10 == 3]
sred = max(A)
M = [int(i) for i in open('17.txt')]
count = 0
maxi = 0
for i in range(0, len(M)-1):
        if (str(M[i])[-1] == '3' and str(M[i+1])[-1] != '3') or (str(M[i+1])[-1] == '3' and str(M[i])[-1] != '3'):
            if (M[i+1]**2 + M[i]**2) >= sred**2:
                count += 1
                maxi = max(maxi, (M[i]**2 + M[i+1]**2))
print(count, maxi)
'''
# Ответ: 180 190360573


# Тип 24 № 27692 i
# Текстовый файл состоит не более чем из 10**6 символов A, B и C.
# Определите максимальное количество идущих подряд символов B.
'''
# Вариант 1
s = open('24.txt').readline()
count = 1
max_count = 0
for i in range(0, len(s)):
    # if s[i] == 'B' and s[i+1] == 'B':
    if s[i:i+2] == 'BB':
        count += 1
        max_count = max(max_count, count)
    else:
        count = 1
print(max_count)

# Bариант 2
print(max([len(i) for i in open('24.txt').readline().replace("A", ' ').replace('C', ' ').split()]))

s = open('24.txt').readline()
s = s.replace("A", ' ').replace('C', ' ')
M = [len(i) for i in s.split()]
print(max(M))

# Вариант 3  ctrl + F
s = open('24.txt').readline()
print(s)
print(len('BBBBBBBBBBB'))
'''
# Ответ: 11


# endregion Урок: ************************************************************


# todo: Мария = [2, 5, 8, 9.1, 12, 14+, 16+, 17, 23, 25.1]
# на прошлом уроке: Решили две сложные задачи на 17 номер, чуть-чуть затронули 24 номер.
# на следующем уроке: Продолжаем 24 номера