
# region Домашка:  ************************************************************



# endregion Домашка: ************************************************************


# region Урок:  ************************************************************



# endregion Урок: ************************************************************


# todo: Мария = [2, 5, 8, 9.1, 12, 14+, 16+, 17, 23, 24+, 25.1]
# на прошлом уроке: Разбирали 3 номер и решили одну 22 задачку. Надо решать еще 22 номер.
# на следующем уроке: