# region Домашка: ********************************************************



# endregion Домашка: ********************************************************


# region Урок: ********************************************************

f = open('9.txt')
for s in f:
    M = [float(i) for i in s.replace(',', '.').replace('/', '.').split()]
    print(M)


# endregion Урок: ********************************************************


# todo: Никита = [2, 5, 6, 8, 9, 12, 14+, 15, 16, 17, 23, 24+, 25+-], на следующем уроке: Прорешиваем 19-21 номер теорию игр на две кучи

