# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# Тип 26 № 35915
# В текстовом файле записан набор натуральных чисел, не превышающих 10**9. Гарантируется, что все числа различны.
# Необходимо определить, сколько в наборе таких пар нечётных чисел, что их среднее арифметическое тоже присутствует
# в файле, и чему равно наибольшее из средних арифметических таких пар.

f = open('26.txt')
N = int(f.readline())
count = 0
maxi = 0
nums = [int(i) for i in f]
for i in range(0, N):
    for j in range(i+1, len(nums)):
        if nums[i] % 2 != 0 and nums[i+1] % 2 != 0:
            if (nums[i] + nums[j]) / 2 in nums:
                count += 1
                maxi = max(maxi, (nums[i] + nums[j]) / 2)
                print(count, maxi)



# endregion Урок: ******************************************************************

# todo: 18 и 26 номера в столбик

# todo: Никита3 = [1, 2, 3, 4, 5, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# на прошлом уроке: Повторили 3, 22, 18 номера на Эксель и затронули табличный 26 номер.
# на следующем уроке:
