# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************
'''
numbers = [1, 2, 3]

print(numbers)

numbers.reverse()
print(numbers.reverse.__doc__)

print(range.__doc__)  # todo: Надо попрравить эту функию
'''

# Тип 15 № 15803 i
# На числовой прямой задан отрезок A. Известно, что формула
#
# ((x ∈ A) → (x**2 ≤ 100)) ∧ ((x**2 ≤ 64) → (x ∈ A))
#
# тождественно истинна при любом вещественном x. Какую наибольшую длину может иметь отрезок A?

# P ∈ N ∈ Z ∈ Q ∈ I ∈ R ∈ C
'''
def F(x):
    A = a1 <= x <= a2
    return (A <= (x**2 <= 100)) and ((x**2 <= 64) <= A)

R = []
M = [i/4 for i in range(-100, 100)]
print(M)

for a1 in M:
    for a2 in M:
        if all(F(x) for x in M):
            R.append(a2-a1)
print(max(R))
'''


# Тип 15 № 34515 i
# Обозначим через m&n поразрядную конъюнкцию неотрицательных целых чисел m и n.
#
# Например, 14&5 = 11102 & 01012 = 01002 = 4.
#
# Для какого наименьшего неотрицательного целого числа А формула (x&41 ≠ 0) → ((x&33 = 0) → (x&А ≠ 0))
#
# тождественно истинна (т. е. принимает значение 1 при любом неотрицательном целом значении переменной х)?


# print(14 & 5)

'''
def F(x):
    return (x&41 != 0) <= ((x&33 == 0) <= (x&A != 0))

for A in range(0, 1000000):
    if all(F(x) for x in range(0, 1000)):
        print(A)
        break

# Вариант 2
print(min([A for A in range(0, 1000) if all(((x&41 != 0) <= ((x&33 == 0) <= (x&A != 0))) for x in range(0, 1000))]))
'''


# Тип 14 № 8664 i
# Сколько единиц содержится в двоичной записи значения выражения: 8**2020 + 4**2017 + 26 – 1?
x = 8**2020 + 4**2017 + 26 - 1
s = bin(x)[2:]
print(s.count('1'))

# endregion Урок: ******************************************************************


# todo: Никита3 = []
# на прошлом уроке:
# на следующем уроке:
