
# region Домашка: ******************************************************************



# endregion Домашка: ******************************************************************



# region Урок: ******************************************************************




# endregion Урок: ******************************************************************


# todo: Никита2 = [5, 3, 17.1, 19-21, 22]
# на прошлом уроке: Повторили 19-21 номера на две кучи и разобрли 3 номер через функцию ВПР.
# на следующем уроке: