
# region Домашка: ******************************************************************



# endregion Домашка: ******************************************************************



# region Урок: ******************************************************************


# Задача № 4604 Поляков
# На числовой прямой даны два отрезка: P = [15, 60] и Q = [15, 30].
# Найдите наименьшую возможнуюдлину отрезка A, при котором формула
#
# (¬(x ∈ Q) ∨ (x ∈ P)) ∧ (x ∈ A)
#
# тождественно ложна, то есть принимает значение 0 при любых x.

def F(x):
    P = 15 <= x <= 60
    Q = 15 <= x <= 30
    A = a1 <= x <= a2
    return (Q <= P) and A

R = []
M = [i for i in range(0, 70)]
for a1 in M:
    for a2 in M:
        if all(F(x) == 0 for x in M):
            print(a1, a2, a2-a1)
            R.append(a2-a1)
print(min(R))


# (№ 4602) Поляков
# На числовой прямой даны два отрезка: P = [20, 30] и Q = [35, 57].
# Найдите наибольшую возможную длину отрезка A, при котором формула
# (x ∈ A) ∧ ((x ∈ Q) → (x ∈ P))
# тождественно ложна, то есть принимает значение 0 при любых x.

def F(x):
    P = 20 <= x <= 30
    Q = 35 <= x <= 57
    A = a1 <= x <= a2
    return A and (Q <= P)

R = []
M = [i for i in range(10, 60)]
for a1 in M:
    for a2 in M:
        if all(F(x) == 0 for x in M):
            R.append(a2-a1)
print(max(R))

# Ответ: 22


# № 1320 (Уровень: Средний)  Кегэ
# На числовой прямой даны три отрезка: P=[10,25], Q=[15,30] и R=[25,40].
# Какова максимальная длина отрезка A, при котором формула:
#
# ((x ∈ Q) → (x ∉ R) ) ∧ (x ∈ A) ∧ (x ∉ P)
#
# тождественно ложна, то есть принимает значение 0 при любом значении переменной х?

def F(x):
    P = 10 <= x <= 25
    Q = 15 <= x <= 30
    R = 25 <= x <= 40
    A = a1 <= x <= a2
    return (Q <= (not R)) and A and (not P)

R = []
M = [i for i in range(0, 100)]
for a1 in M:
    for a2 in M:
        if all(F(x) == 0 for x in M):
            R.append(a2-a1)
print(max(R))

# Ответ: 20


# № 2356 (Уровень: Базовый)  КЕГЭ
#  На числовой прямой даны два отрезка: P = [10, 45] и Q = [35, 78].
#  Найдите наименьшую возможную длину отрезка A, при котором формула
# (¬(x ∈ P) → (x ∈ Q)) ∧ ¬(x ∈ A)
# тождественно ложна, то есть принимает значение 0 при любых x.

def F(x):
    P = 10 <= x <= 45
    Q = 35 <= x <= 78
    A = a1 <= x <= a2
    return ((not P) <= Q) and (not A)

R = []
M = [i for i in range(5, 80)]
for a1 in M:
    for a2 in M:
        if all(F(x) == 0 for x in M):
            R.append(a2-a1)
print(min(R))

# Ответ: 68

# -----------------------------------------


# На числовой прямой даны три интервала: P=[10,14], Q=[5,20] и R=[15,25].
# Определите наибольшую возможную длину отрезка A, при выборе которого выражения
# (x ∉ A) → (x ∈ P) и (x ∈ Q) → (x ∈ R)  принимают различные значения при любых x.\
'''
def F(x):
    P = 10 <= x <= 14
    Q = 5 <= x <= 20
    R = 15 <= x <= 25
    A = a1 <= x <= a2
    return ((not A) <= P) == (not(Q <= R))

R = []
M = [i/4 for i in range(0*4, 30*4)]
for a1 in M:
    for a2 in M:
        if all(F(x) for x in M):
            R.append(a2-a1)
print(min(R))
'''


# Значение выражения 64**12 – 8**14 + x записали в восьмеричной системе счисления, при этом в записи оказалось 12 цифр 7 и одна единица.
# При каком минимальном натуральном x это возможно?
'''
for x in range(1, 1000):
    n = 64**12 - 8**14 + x

    M = []
    while n > 0:
        M.append(n % 8)
        n //= 8
    M.reverse()

    if M.count(7) == 12 and M.count(1) == 1:
        print(x)
        break
'''
# Ответ: 127




# endregion Урок: ******************************************************************


# todo: Никита2 = [5, 17.1, 22]
# на прошлом уроке: Потупили с 15 номером и разобрали по задаче на теорию игр 19-21 (куча и две кучи)
# на следующем уроке: