# region Домашка: ********************************************************



# endregion Домашка: ********************************************************


# region Урок: ********************************************************





# endregion Урок: ********************************************************


# todo: Никита = [2, 5, 6, 8, 9.1, 12, 14+, 15+, 16, 17, 18, 19-21, 23, 24+, 25.2]
# на прошлом уроке: Прорешивали задачи номер 3 и 22.
# на следующем уроке: Добиваем задачи 3, 22 и переходим к Письменной части
