# region Домашка: ********************************************************



# endregion Домашка: ********************************************************


# region Урок: ********************************************************

# Тип 15 № 34517
# Обозначим через m&n поразрядную конъюнкцию неотрицательных целых чисел m и n.
#
# Так, например, 12 & 6 = 1100_2 & 0110_2 = 0100_2 = 4.
#
# Для какого наибольшего целого числа А формула
#
# х&А не равно 0 → (x&10 = 0 → х & 3 не равно 0)
#
# тождественно истинна (т.е. принимает значение 1 при любом неотрицательном целом значении переменной x)?

# Вариант 1
'''
def F(x, A):
    Q = x & A == 0
    W = x & 10 == 0
    R = x & 3 == 0
    return (not Q) <= (W <= (not R))

    # return (x & A != 0) <= ((x & 10 ==0) <= (x & 3 != 0))

for A in range(0, 1000):
    flag = True
    for x in range(0, 1000):
        if F(x, A) == False:
            flag = False
            break
    if flag == True:
        print(A)
'''

# Вариант 2
'''
def F(x):
    Q = x & A == 0
    W = x & 10 == 0
    R = x & 3 == 0
    return (not Q) <= (W <= (not R))

M = [i for i in range(0, 1000)]

for A in M:
    if all(F(x) for x in M):
        print(A)
'''


# Вариант 3
'''
def F(x):
    Q = x & A == 0
    W = x & 10 == 0
    R = x & 3 == 0
    return (not Q) <= (W <= (not R))

for A in range(0, 1000):
    if all(F(x) for x in range(0, 1000)):
        print(A)
'''



# Тип 15 № 47012
'''
# На числовой прямой даны два отрезка: P=[69;91] и Q=[77;114].
# Укажите наименьшую возможную длину такого отрезка A, для которого формула
#
# (x∈P)→(¬((x∈P)≡(x∈Q))∨((x∈Q)→(x∈A)))
#
# тождественно истинна (т.е. принимает значение 1 при любом значении переменной х).

def F(x):
    P = 69 <= x <= 91
    Q = 77 <= x <= 114
    A = a1 <= x <= a2
    return P <= ((not(P == Q)) or (Q <= A))

M = [i/4 for i in range(50*4, 120*4)]

R = []
for a1 in M:
    for a2 in M:
        if all(F(x) for x in M) == True:
            R.append(a2-a1)
print(min(R))
'''
# Ответ: 14

# Тип 15 № 38590
'''
# На числовой прямой даны два отрезка: D=[17;58] и C=[29;80].
# Укажите наименьшую возможную длину такого отрезка A, для которого логическое выражение
#
# (x∈D)→((¬(x∈C)∧¬(x∈A))→¬(x∈D))
#
# истинно (т.е. принимает значение 1) при любом значении переменной х.

def F(x):
    D = 17 <= x <= 58
    C = 29 <= x <= 80
    A = a1 <= x <= a2
    return D <= ((not(C) and (not A)) <= (not D))

M = [i/4 for i in range(10*4, 100*4)]

R = []
for a1 in M:
    for a2 in M:
        if all(F(x) for x in M) == True:
            R.append(a2-a1)
print(min(R))
'''
# Ответ: 12 (округляем вверх)



# Тип 15 № 33094
'''
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».
#
# Для какого наибольшего натурального числа А формула
#
# (A < 50) ∧ (¬ДЕЛ(x, А) → (ДЕЛ(x, 10) → ¬ДЕЛ(x, 18)))
#
# тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной x)?


def F(x):
    return (A < 50) and ((x % A != 0) <= ((x % 10 == 0) <= (x % 18 != 0)))

for A in range(1, 1000):
    if all(F(x) for x in range(1, 1000)) == True:
        print(A)
'''
# Ответ: 45



# № 3156
'''
# Элементами множеств А, P и Q являются натуральные числа,
# причём P = { 2, 4, 6, 8, 10, 12, 14, 16, 18, 20} и Q = { 5, 10, 15, 20, 25, 30, 35, 40, 45, 50}. Известно, что выражение
#
# ((x ∈ A) → (x ∈ P)) ∧ ((x ∈ Q) → ¬(x ∈ A))
#
# истинно (т. е. принимает значение 1) при любом значении переменной х.
# Определите наибольшее возможное количество элементов множества A.

a = set(range(0, 1000))

def F(x):
    P = x in {2, 4, 6, 8, 10, 12, 14, 16, 18, 20}
    Q = x in {5, 10, 15, 20, 25, 30, 35, 40, 45, 50}
    A = x in a
    return (A <= P) and (Q <= (not A))

for x in range(0, 1000):
    if F(x) == False:
        a.remove(x)

print(a, len(a))
'''
# Ответ: 8



# № 1409
'''
# Элементами множеств А, P, Q, R являются натуральные числа,
# причём P={2,4,6,8,10,12,14,16,18,20}, Q={3,6,9,12,15,18,21,24,27,30}, R={12,24,36,48,60}. Известно, что выражение
#
# (x ∉ A) → (((x ∈ P) ∧ (x ∈ Q)) → (x ∈ R))
#
# истинно (т.е. принимает значение 1 при любом значении переменной х. Определите наименьшее возможное произведение элементов в множестве A.

a = set()

def F(x):
    P = x in {2,4,6,8,10,12,14,16,18,20}
    Q = x in {3,6,9,12,15,18,21,24,27,30}
    R = x in {12,24,36,48,60}
    A = x in a
    return (not A) <= ((P and Q) <= R)

for x in range(0, 1000):
    if F(x) == False:
        a.add(x)
print(a)
print(18*6)
'''
# Ответ: 108


# endregion Урок: ********************************************************


# todo: Никита = [2, 5, 6, 8, 9, 12, 14+, 15+, 16, 17, 19, 20, 21, 23, 24+, 25+-], на следующем уроке: 15 номер на отрезки и множества

