# region Домашка: ********************************************************

#№ 1072
# Элементами множеств А, P и Q являются натуральные числа,
# причём P = { 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30} и Q = {1, 4, 7, 10, 13, 16, 19, 22, 25, 28, 31}.
#
# Известно, что выражение
#
# ((x ∈ A) → (x ∈ P)) ∧ ((x ∈ Q) → (x ∉ A))
#
# истинно (т. е. принимает значение 1) при любом значении переменной х.
# Определите наибольшее возможное количество элементов множества A.
'''
a = set(range(1, 1000))
def F(x):
    P = x in {2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30}
    Q = x in {1, 4, 7, 10, 13, 16, 19, 22, 25, 28, 31}
    A = x in a
    return (A <= P) and (Q <= (not A))

for x in range(0,1000):
    if F(x) == False:
        a.remove(x)
print(a, len(a))
'''


# № 754
# Элементами множеств А, P и Q являются натуральные числа, причём P = { 2, 4, 6, 8, 10, 12, 14, 16, 18, 20} и Q = { 5, 10, 15, 20, 25, 30, 35, 40, 45, 50}. Известно, что выражение
#
# ((x ∈ A) → (x ∈ P)) ∧ ((x ∈ Q) → ¬(x ∈ A))
#
# истинно (т. е. принимает значение 1) при любом значении переменной х.
# Определите наибольшее возможное количество элементов множества A.
'''
a = set(range(0, 1000))
def F(x):
     P = x in {2, 4, 6, 8, 10, 12, 14, 16, 18, 20}
     Q = x in {5, 10, 15, 20, 25, 30, 35, 40, 45, 50}
     A = x in a
     return (A <= P) and (Q <= (not A))

for x in range(0, 1000):
    if F(x) == False:
       a.remove(x)
print(a, len(a))
'''

# endregion Домашка: ********************************************************


# region Урок: ********************************************************



# endregion Урок: ********************************************************


# todo: Никита = [2, 5, 6, 8, 9, 12, 14+, 15+, 16, 17, 19, 20, 21, 23, 24+, 25.2]
# на прошлом уроке: Прорешали 18 номер  5-6 задач на энергию, стенки и ладью.
# на следующем уроке: Продолжаем 18 номер на робота
