# region Домашка: ********************************************************



# endregion Домашка: ********************************************************


# region Урок: ********************************************************



# endregion Урок: ********************************************************


# todo: Никита = [2, 5, 6, 8, 9, 12, 14+, 15+, 16, 17, 19, 20, 21, 23, 24+, 25.2]
# на прошлом уроке: Повторили 18 номер 5-6 задач на энергию, стенки и ладью.
# на следующем уроке: Продолжаем 18 номер на робота
