# region Домашка: ********************************************************



# endregion Домашка: ********************************************************


# region Урок: ********************************************************

# Тип 7 № 47211 i
# Музыкальный фрагмент был записан в формате моно, оцифрован и сохранён в виде файла без использования сжатия данных. Размер полученного файла — 28 Мбайт.
# Затем тот же музыкальный фрагмент был записан повторно в формате стерео (двухканальная запись) и оцифрован с разрешением в 3,5 раза выше и частотой дискретизации в 2 раза меньше,
# чем в первый раз. Сжатие данных не производилось. Укажите размер полученного при повторной записи файла в Мбайт.
# В ответе запишите только целое число, единицу измерения писать не нужно.

# I = кол-во каналов * время (сек) * частота (гц) * битное резшенение (бит)

# 28 = 1 * a * b
# 28  = 2 * (3.5 * a) * (b / 2)

print((28 * 2 * 3.5) / 2)

# Ответ: 98



# endregion Урок: ********************************************************


# todo: Никита = [2, 5, 6, 8, 9.1, 12, 14+, 15+, 16, 17, 18, 19-21, 23, 24+, 25.2]
# на прошлом уроке: Решали задачи 4, 7. На 7, 11 номеа нужно выделить отдельный урок, были сложности с еденицами измерения.
# на следующем уроке: Порешать, 7 и 11 номера и порешать задачи через айдл
