# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# КЕГЭ № 12463 PRO100 ЕГЭ 29.12.23 (Уровень: Базовый)
# Откройте файл электронной таблицы, содержащей в каждой строке девять натуральных чисел.
# Определите количество строк таблицы, для чисел которых выполнены оба условия:
#
#  - в строке есть одно число, которое повторяется четыре раза, есть другое число,
#  которое повторяется дважды, остальные три числа различны;
#  - среднее арифметическое трёх неповторяющихся чисел строки не меньше наибольшего
#  из повторяющихся в строке чисел.
'''
cnt = 0
for s in open('9.txt'):
    # s = '442 455	321	442	926	442	442	402	321'
    # M = [x for x in s]  # '4' '4' '2' ' ' ' ' '4' '5' '5' ' ' ' ' '3' '2' '1' ...
    # M = [x for x in s.split()]  # ['45', '348', '850', '850', '647', '348', '850', '850', '177']
    # M = [int(x) for x in s.split()]  # [45, 348, 850, 850, 647, 348, 850, 850, 177]
    M = [int(x) for x in s.split()]
    copied4 = [x for x in M if M.count(x) == 4]  # [850, 850,850, 850]
    copied2 = [x for x in M if M.count(x) == 2]  # [348, 348]
    copied1 = [x for x in M if M.count(x) == 1]  # [45, 647, 177]
    if len(copied4) == 4 and len(copied2) == 2 and len(copied1) == 3:
        if (sum(copied1) / len(copied1)) >= max(copied2 + copied4):
            cnt += 1
print(cnt)
'''

M = [5, 6, 3, 7, 8]
summa = 29
lenn = 5
avg = summa / lenn  # 5.8



# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************


# Тимур = [2, 5, 6, 8, 9, 12, 14, 15, 16, 17, 23]
# КЕГЭ  = []
# на следующем уроке:
