# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

from itertools import *
table = '12 15 21 23 25 32 36 37 38 46 47 51 52 58 63 64 67 68 73 74 76 83 85 86'
graph = 'АБ БА АИ ИА ИБ БИ БЖ ЖБ ИЖ ЖИ БВ ВБ ЖВ ВЖ ЖЕ ЕЖ ВГ ГВ ЕГ ГЕ ЕД ДЕ ДГ ГД'

for per in permutations('АБВГДЕЖИ'):
    new_table = table
    for i in range(1, 8+1):
        new_table = new_table.replace(str(i), per[i-1])
    if set(new_table.split()) == set(graph.split()):
        print('1 2 3 4 5 6 7 8')
        print(*per)
        # 1 2 3 4 5 6 7 8
        # Д Е Ж А Г Б И В

# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************


# Тимур = [1, 2, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 23, 25]
# КЕГЭ  = []
# на следующем уроке:
