# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# Теория:
# IP состоит из 4 чисел, на каждое из которых выделяется по 1 байту (то есть по 8 бит)
# Из этого можно сделать вывод, что числа лежат в диапазоне от 0 до 255 (11111111)

# Адрес сети = IP адрес узла & Маска сети, & - побитовая конъюнкция

# Маска сети имеет длину 32 бита и вид: 111111...0000, например: 11111111111111111110000000000000


# Тип 13 №3532
# По заданным IP-адресу узла и маске определите адрес сети.
# IP адрес узла: 217.9.142.131
# Маска: 255.255.224.0
'''
from ipaddress import *
net = ip_network('217.9.142.131/255.255.224.0', 0)
print(net)  # 217.9.128.0/19, где 19 - кол-во единиц в маске сети
# # 11111111.11111111.11100000.00000000
print(net.netmask)  # 255.255.224.0
print(f'{net.netmask:b}')  # 11111111111111111110000000000000
'''
# 217.9.128.0/19
# Ответ: HBDA


# Тип 13 №6343
# По заданным IP-адресу узла и маске определите адрес сети.
# IP-адрес узла: 32.64.208.224
# Маска: 255.255.192.0
'''
from ipaddress import *
net = ip_network('32.64.208.224/255.255.192.0', 0)
print(net)  # 32.64.192.0/18
'''
# Ответ: BCEA


# Тип 13 №9304
# Для узла с IP-адресом 227.138.127.144 адрес сети равен 227.138.64.0.
# Чему равен третий слева байт маски?
# Ответ запишите в виде десятичного числа.
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'227.138.127.144/{mask}', 0)
    print(net, net.netmask)
    # 227.138.64.0/18 255.255.192.0
'''
# Ответ: 192


# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************


# Тимур = [2, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 23]
# КЕГЭ  = []
# на следующем уроке:
