# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************
'''
def F(x, A):
    B = 50 <= x <= 70
    return (x % A == 0) or (B <= (x % 16 != 0))

R = []
for A in range(1, 1000):
    if all(F(x, A) for x in range(1, 10000)):
        R.append(A)
print(max(R))
'''
'''
def F(x):
    D = 7 <= x <= 68
    C = 29 <= x <= 100
    A = a1 <= x <= a2
    return D <= (((not C) and (not A)) <= (not D))

M = [i / 4 for i in range(1 * 4, 110 * 4)]
R = []
for a1 in M:
    for a2 in M:
        if all(F(x) for x in M):
            R.append(a2-a1)
print(min(R))
'''


#
# Для узла с IP-адресом 76.89.95.123 третий слева байт маски равен 240.
# Чему равен третий байт адреса сети для этого узла?

from ipaddress import *
for mask in range(33):
    net = ip_network(f'76.89.95.123/{mask}', 0)
    print(net, net.netmask)
    # 76.89.80.0/20 255.255.240.0

# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************


# Тимур = [1, 2, 4, 5, 6, 7, 8, 9, 12, 13, 14, 15, 16, 17, 23, 25]
# КЕГЭ  = [13, 15, 16, 23, 25]
# на следующем уроке:
