# region Домашка: ************************************************************

# endregion Домашка: ************************************************************


# region Урок: *************************************************************
'''
print('x y z w F')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                F = ((x <= y) == (z <= w)) or (x and w)  #  F задаётся выражением ((x → y ) ≡ (z → w)) ∨ (x ∧ w)
                if F == False:
                    print(x, y, z, w, int(F))
'''

# endregion Урок: ************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************


# Александра = []
# КЕГЭ = []
# на следующем уроке:
