# region Домашка: ************************************************************

# endregion Домашка: ************************************************************


# region Урок: *************************************************************

# КЕГЭ № 2356 (Уровень: Базовый)
# На числовой прямой даны два отрезка: P = [10, 45] и Q = [35, 78].
# Найдите наименьшую возможную длину отрезка A, при котором формула
# (¬(x ∈ P) → (x ∈ Q)) ∧ ¬(x ∈ A)
# тождественно ложна, то есть принимает значение 0 при любых x.
'''
def F(a1, a2, x):
    P = 10 <= x <= 45
    Q = 35 <= x <= 78
    A = a1 <= x <= a2
    return ((not P) <= Q) and (not A)


M = [x / 4 for x in range(5 * 4, 85 * 4)]
print(M)
R = []
for a1 in M:
    for a2 in M:
        if all(F(a1, a2, x) == False for x in M):
            R.append(a2 - a1)
print(min(R))
'''
# 68.0 -> 68





# endregion Урок: ************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************


# Александра = []
# КЕГЭ = []
# на следующем уроке:
