# region Домашка: ************************************************************

# endregion Домашка: ************************************************************


# region Урок: ************************************************************

'''
kol_byte_na_symbol = int(input('Вводим бит и считаем кол-во байт на 1 символ: ')) // 8  # 16
stroka = input('Строка с названиями: ')      # D, Io, Ada, Java, Swift, Python, ColdFusion
kol_symbols = (int(input('Введите разность от сходного: ')) - (2 * kol_byte_na_symbol)) // kol_byte_na_symbol

new_s = stroka.split(', ')
for slovo in new_s:
    if len(slovo) == kol_symbols:
        print(slovo)
'''





# endregion Урок: ************************************************************



# todo: Александра = []
# на прошлом уроке: Обсудили сложную домашку по машинному обучению, надо читать материалы
# на следующем уроке:
