# region Домашка: ************************************************************



# endregion Домашка: ************************************************************


# region Урок: ************************************************************
'''
import numpy as np
a = np.arange(40).reshape(5, 8)
a[4, 5] = -55
np.amax(a, axis=0)

print(a)
print(f'Выведем максимальный элемент массива а: {np.amax(a)}')
print(f'Выведем максимальный элемент массива а: {np.amax(a, axis=1)}')
print(f'Выведем максимальный элемент массива а: {np.amax(a, axis=0)}')
M = [1,5,78,33,24,3,43,4,32,34,234,23,43,43,43,43,4,342,21,342]
'''

'''
import numpy as np
a = np.array([[1, 2, 3], [4, 5, 6]])
print(a)

# [[1 2 3]
#  [4 5 6]]

print(a[1][1])
print(a[1][2])

a[1][2] = -55

print(a)
'''

'''
import numpy as np

a = np.array([[1, 2], [3, 4]])
print(a)
# Транспонирование
b = a.T
print(b)

# Изменение размерности
c = a.reshape((1, 4))

print(c)
'''


'''
import numpy as np

a = np.array([1, 2, 3, 4, 5, 6])

print(a)
# Изменение размерности с одномерного на двумерный массив размером 2x3
b = a.reshape((2, 3))
print(b)

# Изменение размерности с двумерного на одномерный массив длиной 6
c = b.reshape(6)

# Изменение размерности с двумерного на трехмерный массив размером 2x3x1
d = b.reshape((2, 3, 1))

print(d)
'''

'''
import numpy as np

a = np.array([[1, 2], [3, 4]])

# Сумма всех элементов массива
b = np.sum(a)
print(b)
'''

import numpy as np

a = np.array([[1, 2], [3, 4]])
print(a)
# Индекс максимального элемента массива
b = np.argmax(a)
print(b)
# Индекс минимального элемента массива
c = np.argmin(a)
print(c)
# endregion Урок: ************************************************************



# todo: Александра = []
# на прошлом уроке:
# на следующем уроке: