
# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************



# region Урок: ******************************************************************





# endregion Урок: ******************************************************************


# todo: Сергей = [2, 5, 8, 12, 14, 15]
# на прошлом уроке: Повторяли 15-ые номера, Сергей прорешивал сам, так-как задание вызвало трудности.
# на следующем уроке:
