# region Домашка: ******************************************************************
'''
L = [4, 5, 6, 9]
L[1] = 14
L.append(1)
L.append(2)
L.append(5)
del L[0]
L= L * 3
L = L[:4] + [45] + L[4:]
print(L)
'''
# [14, 6, 9, 1, 45, 5, 14, 6, 9, 1, 2, 5, 14, 6, 9, 1, 2, 5]
# [14, 6, 9, 1, 45, 2, 5, 14, 6, 9, 1, 2, 5, 14, 6, 9, 1, 2, 5]
# [14, 6, 9, 1, 45, 2, 5, 14, 6, 9, 1, 2, 5, 14, 6, 9, 1, 2, 5]

'''
M = [5, -10, 4, 0, -4]
M.remove(4)
M += [3, 2, 1]
print(M)  # [5, -10, 0, -4, 3, 2, 1]
'''
# endregion Домашка: ******************************************************************


# region Урок: ********************************************************************

# В файле электронной таблицы 9-221.xls в каждой строке записаны пять натуральных чисел.
# Определите количество строк таблицы, для которых выполнено ровно одно из следующих условий:
#
# – одно число повторяется дважды, остальные числа различны;
# – сумма всех нечетных значений больше суммы четных значений
# (если чисел с определенным признаком четности нет, то считаем сумму равной нулю).
'''
count = 0
for s in open('9.txt'):
    M = [int(x) for x in s.split()]
    flag1, flag2 = False, False
    if any(M.count(x) == 2 for x in M) and len(set(M)) == 4:  # – одно число повторяется дважды, остальные числа различны;
        flag1 = True
    chet = [x for x in M if x % 2 == 0]
    nechet = [x for x in M if x % 2 != 0]
    if sum(nechet) > sum(chet):
        flag2 = True
    if flag1 + flag2 == 1:
        count += 1
print(count)


count = 0
for s in open('9.txt'):
    M = [int(x) for x in s.split()]
    chet = [x for x in M if x % 2 == 0]
    nechet = [x for x in M if x % 2 != 0]
    # для которых выполнено ровно одно из следующих условий ==> "^"
    if (any(M.count(x) == 2 for x in M) and len(set(M)) == 4) ^ (sum(nechet) > sum(chet)):
        count += 1
print(count)
'''
# Ответ: 482

# todo Обсудить Генераторы списков и строки

# endregion Урок: ******************************************************************


# Славик = [2.1, 6.1]
# КЕГЭ  = []
# на следующем уроке:
