
# region Домашка: ******************************************************************************


# endregion Домашка:  ******************************************************************************


# region Урок:  ******************************************************************************

# todo: Тип 27 № 27424
nums = [[1, 2], [2, 3], [3, 4]]
summ = 0
for x in range(len(nums)):
    for i in range(2):
        for j in range(2):
            summ += nums
            print(i, j)

'''
# todo  Тип 27 № 37162
f = open('27_AAAAA.txt')
n = f.readline()
A = []
N = []
M = [int(i) for i in f]
for i in range(len(M)):
    A.clear()
    for j in range(i+1, len(M)):
        A.append(j)
        if sum(A) % 89 == 0 and sum(A) % len(A) == 0:
            N.append([sum(A), len(A)])

for x in sorted(N):
    print(x)
'''



# endregion Урок:  ******************************************************************************

# todo: дорешать крайнюю задачу 14 номера
# Слава
# todo: РЕШУ ЕГЭ = [1, 2, 5, 6, 8, 9, 12, 13, 14+, 15+, 16, 17, 18, 19-21, 23, 24+, 25.2]
# todo: КЕГЭ [1, 5, 8, 9, 13, 14, 17, 24, 25] # рассмотреть: 6, 9, 22, 17 КЕГЭ
# на прошлом уроке: Порешали 27 номера первую часть, было сложно, но половину, точно осилили.
# на следующем уроке:
