
# region Домашка: ******************************************************************************


# endregion Домашка:  ******************************************************************************



# region Урок:  ******************************************************************************




# endregion Урок:  ******************************************************************************

# Слава
# todo: РЕШУ ЕГЭ = [1, 2, 5, 6, 8, 9, 12, 13, 14+, 15+, 16, 17, 18, 19, 20, 21, 23, 24+, 25.2]
# todo: КЕГЭ [1, 5, 8, 13] # рассмотреть: 6, 9, 22, 17 КЕГЭ
# на прошлом уроке: Прорешивали 12 номера сайте КЕГЭ, пришли к выводы, что itertools не решает всех задач.
# на следующем уроке: Попробовать прорешивать 17, 24 номера КЕГЭ
