# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ********************************************************************

# Тип 15 №45249
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».
#
# Для какого наименьшего натурального числа А формула
# (ДЕЛ(x, 3) → ¬ДЕЛ(x, 5)) ∨ (x+A≥90)
# тождественно истинна (т.е. принимает значение 1) при любом натуральном значении переменной x?
'''
# Вариант 1
def F(x, A):
    return ((x % 3 == 0) <= (x % 5 != 0)) or (x+A >= 90)


for A in range(1, 1000):
    flag = True
    for x in range(1, 10000):
        if not F(x, A):
        # if F(x, A) == False:
            flag = False
            break
    # if flag == True:
    if flag:
        print(A)
        break


# Вариант 2
for A in range(1, 1000):
    k = 0
    for x in range(1, 1000):
        if ((x % 3 == 0) <= (x % 5 != 0)) or (x + A >= 90):
            k += 1
    if k == 999:
        print(A)
        break


# Вариант 3
def F(x, A):
    return ((x % 3 == 0) <= (x % 5 != 0)) or (x+A >= 90)


for A in range(1, 1000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
        break

# Вариант 3.2
def F(x, A):
    return ((x % 3 == 0) <= (x % 5 != 0)) or (x+A >= 90)

R = []
for A in range(1, 1000):
    if all(F(x, A) for x in range(1, 10000)):
        R.append(A)
print(min(R))

# Вариант 4
print(min([A for A in range(1, 1000) if all((((x % 3 == 0) <= (x % 5 != 0)) or (x+A >= 90)) for x in range(1, 10000))]))
'''
# Ответ: 75


# Тип 15 №15140
# Сколько существует целых значений числа A, при которых формула
# ((x < A) → (x**2 < 81)) ∧ ((y**2 ≤ 36) → (y ≤ A))
# тождественно истинна при любых целых неотрицательных x и y?
'''
def F(x, y, A):
    return ((x < A) <= (x**2 < 81)) and ((y**2 <= 36) <= (y <= A))


R = []
for A in range(1, 1000):
    if all(F(x, y, A) for x in range(1, 100) for y in range(100)):
        R.append(A)
print(len(set(R)))
'''
# Ответ: 4


# Тип 15 №34518
# Обозначим через m&n поразрядную конъюнкцию неотрицательных целых чисел m и n.
# Так, например, 12 & 6 = 1100_2 & 0110_2 = 0100_2 = 4.
# Для какого наибольшего целого числа А формула
# х&А → (x&36 = 0 → х&6)
# тождественно истинна (т. е. принимает значение 1 при любом неотрицательном целом значении переменной x)?
'''
def F(x, A):
    return (x & A != 0) <= ((x & 36 == 0) <= (x & 6 != 0))

R = []
for A in range(0, 1000):
    if all(F(x, A) for x in range(0, 10000)):
        R.append(A)
print(max(R))
'''
# Ответ: 38


# Тип 15 №9699
# На числовой прямой даны два отрезка: P = [4, 15] и Q = [12, 20].
# Укажите наименьшую возможную длину отрезка A, для которого выражение
# ((x ∈ P) ∧ (x ∈ Q)) → (x ∈ A)
# тождественно истинно, то есть принимает значение 1 при любом значении переменной х.
'''
def F(x, a1, a2):
    P = 4 <= x <= 15
    Q = 12 <= x <= 20
    A = a1 <= x <= a2
    return (P and Q) <= A


R = []
M = [x / 4 for x in range(2 * 4, 22 * 4)]
print(M)
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2-a1)
print(min(R))
'''
# Ответ: 3.0 -> 3

# endregion Урок: *************************************************************


# Славик = [2.1, 5.1, 6.1, 8.1, 9.1, 12.1, 14.1, 15.1, 16.1, 23.1]
# КЕГЭ  = []
# на следующем уроке:
