
# region Домашка: **********************************************************


# endregion Домашка: **********************************************************


# region Урок: **********************************************************



# endregion Урок: **********************************************************


# todo: Стася = [2, 3, 5, 6, 8, 9.2, 12, 14+, 15, 16, 17, 22, 23, 24, 25.2]
# на прошлом уроке: +30 минут на следующий урок, прорешивали задачи на две кучи из Теории игр.
# на следующем уроке:

