
# region Домашка: **********************************************************


# endregion Домашка: **********************************************************


# region Урок: **********************************************************



# endregion Урок: **********************************************************


# todo: Стася = [2, 3, 5, 6, 8, 9.2, 12, 14+, 15, 16, 17, 19-21, 22, 23, 24, 25.2]
# на прошлом уроке: Повторили (Стася сама решила) один номер на две кучи и прорешивали 18 номера.
# на следующем уроке: +30 минут на следующий урок, Будем добивать 18 номера: на просто энергию, на сложные условия, на ладью, на столбец чисел

