# region Домашка: ******************************************************************************



# endregion Домашка: ******************************************************************************


# region Урок: ******************************************************************************

import string
print(string.ascii_uppercase)
ALPHABET = '0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ'


# endregion Урок: ******************************************************************************

import useful

print(useful.Who_Is_Name())

# todo:    Степан   = [1, 2, 3, 4, 5, 7, 8, 9, 13, 14+, 15+, 16, 17, 18, 19-21, 22, 23, 24, 25.2]
# todo: Степан КЕГЭ = []
# на прошлом уроке: Прорешивали задачки
# на следующем уроке:
