# region Домашка: ******************************************************************************



# endregion Домашка: ******************************************************************************


# region Урок: ******************************************************************************




# endregion Урок: ******************************************************************************


# todo: Степан = [2, 5, 8, 14+, 15+, 16, 17, 19, 20, 21, 23, 24, 25.2]
# на прошлом уроке: Разобрались как конвертировать файл 9 задачи, прорешали 9 номер Пайтон и Эксель и разобрали 3 номер
# на следующем уроке: Добиваем 3 номер и переходим к 22, 18 номерам