
# region Домашка:  **************************************************

'''
def Prime(x):
    for j in range(2, int(x ** 0.5)+1):
        if x % j == 0:
            return False
    return True
def Divisors(x):
    dl = set()
    for j in range(2, int(x**0.5)+1):
        if x % j == 0:
            if Prime(j):
                dl.add(j)
            if Prime(x//j):
                dl.add(x//j)
    return sorted(dl)


count = 0
for i in range(22801, 10**5):
    M = Divisors(i)
    if len(M) >= 2:
        E = max(M) - min(M)
        if E % 47 == 17:
            print(i, E)
            count += 1
            if count == 6:
                break
'''

# 22826 111
# 22864 1427
# 22889 440
# 22990 17
# 23018 675



# endregion Урок:  **************************************************




# Татьяна решить номер 5672
# todo: Татьяна РЕШУ = [1, 2, 3, 4, 5, 6, 7, 8, 9.1, 10, 11, 12, 13, 14+, 15+, 16, 17, 18, 19-21, 22, 23, 24, 25]
# todo: Татьяна КЕГЭ = [5, 8, 24, 25]
# на прошлом уроке: Посмотрели на решение 25 через fnmatch и начали решать вариант Вебиум, номера: 5, 6, 8, 11, 14, 15
# на следующем уроке: #todo: разобрать 25 номер 5 варианта Шастина