
# region Домашка:  **************************************************


# endregion Домашка: **************************************************


# region Урок:  **************************************************



# endregion Урок:  **************************************************

# Татьяна решить номер 5672
# todo: Татьяна РЕШУ = [1, 2, 3, 4, 5, 6, 7, 8, 9.1, 10, 11, 12, 13, 14+, 15+, 16, 17, 18, 19-21, 22, 23, 24, 25]
# todo: Татьяна КЕГЭ = [5, 8, 24, 25]
# на прошлом уроке: Взяли вариант Джобса от 03.06 и прорешали номера: 1, 2, 4, 5, 7, 8, 9
# на следующем уроке: