
# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************



# region Урок: ******************************************************************




# endregion Урок: ******************************************************************



# todo: Валерия = [2, 5, 6, 8, 9.1, 12, 14+, 15+, 16, 17, 18, 19-21, 23, 24, 25]
# на прошлом уроке: Разбирали теорию игр 19-21 и начали разбирать 18 номер.
# на следующем уроке: Повторяем 19-21 если нужно, продолжаем 18.
