
# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# Тип 9 № 27524
# Откройте файл электронной таблицы, содержащей вещественные числа — результаты
# ежечасного измерения температуры воздуха на протяжении трёх месяцев.
#
# Сколько раз встречалась температура, которая была ниже половины от максимального значения?

A = []
for s in open('9.txt'):
    A += [float(i) for i in s.replace(',', '.').split()]

count = 0
for x in A:
    if x < max(A) / 2:
        count += 1
print(count)

# Ответ: 601

# endregion Урок: ******************************************************************



# todo: Валерия = [2, 3, 5, 6, 8, 9+, 12, 14+, 15+, 16, 17, 18, 19-21, 22, 23, 24, 25]
# на прошлом уроке: Разбирали задания письменной части: 1 и 13 номера на графы.
# на следующем уроке:
