
# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************



# endregion Урок: ******************************************************************



# todo: Валерия = [1, 2, 3, 5+, 6, 7, 8+, 9+, 11, 12+, 13, 14+, 15+, 16, 17, 18, 19-21, 22, 23, 24, 25]
# на прошлом уроке: Повторяли 7, 11 номера всех типов. На след. уроке будем повторять таблицы.
# на следующем уроке:  #todo: Письменные, Эксель: 9, 19-21, 18, 22, 26
