# region Домашка: ************************************************************

# endregion Домашка: ************************************************************



# region Урок: ************************************************************



# endregion Урок: ************************************************************




# todo:   Василий    = [1, 2, 3, 4, 5, 6, 8, 9, 11, 12, 14+, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# todo: Василий КЕГЭ = [25]
# на прошлом уроке: Посмотрели на домашку: 7, 26 номера. И прорешивали сложные 24 номера с КЕГЭ
# на следующем уроке:
