
# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************


# 15320
'''
from itertools import *
num = 0
for s in product(sorted('ПАРУС'), repeat=5):
    word = ''.join(s)
    num += 1
    if word.count('У') <= 1:
        if 'АА' not in word:
            print(num, word)
            exit()
'''


# 15321
'''
from itertools import *
cnt = 0
for s in open('9.txt'):
    M = sorted([int(x) for x in s.split()])
    if max(M) < sum(M[:3]):
        if any(P[0] + P[1] == P[2] + P[3] for P in permutations(M)):
            cnt += 1
print(cnt)
'''


'''
symbols = 5
alphbaet = 7084 + 10
print(2**13)
i = 13  # бит на один символ

bit = symbols * i
print(bit / 8)  # 8.125 -> 9
byte = 9
print((byte * 22528) / (2**10))
'''
# 198



# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************


# Василий = [1, 2, 3, 4, 5, 6, 8, 12, 13, 14, 15, 16, 17, 19-21, 22, 23, 24, 25]
# КЕГЭ  = [3, 13, 14, 15]
# на следующем уроке:
