
# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# КЕГЭ № 5496(Уровень: Средний)
#
# Текстовый файл содержит только буквы A, C, D, F, O.
# Определите длину самой длинной цепочки символов, которая начинается и заканчивается буквой D,
# а между двумя последовательными буквами D содержит не более двух букв O и произвольное количество других букв.

s = open('24.txt').readline()
s = s.replace('D', 'D D')
maxi = 0
for x in s.split():
    if x.count('O') <= 2:
        if maxi < len(x):
            maxi = len(x)
            print(maxi)
# endregion Урок: ******************************************************************


# Василий = [2.1, 5.1, 6.1, 8.1, 12.1, 14.1, 15.1, 16.1, 17.1, 23.1, 24.1]
# КЕГЭ  = []
# на следующем уроке:
