
# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# Тип 16 №47220
# Алгоритм вычисления значения функции F(n),
# где n — натуральное число, задан следующими соотношениями:

# F(n) = 1 при n = 1;
# F(n) = n * F(n−1), если n>1.
#
# Чему равно значение выражения F(2023) / F(2020)?

import sys
sys.setrecursionlimit(10000)  # увеличиваем глубину рекурсии
def F(n):
    if n == 1:
        return 1
    if n > 1:
        return n * F(n-1)

print(F(2023) / F(2020))
print(2023*2022*2021)

# Ответ: 8266912626

# endregion Урок: ******************************************************************


# todo: Василий = [2.1, 5.1, 6.1, 8.1, 12.1, 14.1, 15.1]
# todo:   КЕГЭ  = []
# на прошлом уроке:
# на следующем уроке:
