
# region Домашка: ******************************************************************

'''
M1 = [22, 11, 13, 20]
M2 = [22, 11, 13, 4]
M3 = [22, 35]

s1 = 'aaabccca'
s2 = 'aaabcccb'
print(max(s1, s2))

print(max(M1, M2, M3))
'''

# todo Проверить в чем косяк (правильный ответ 273, а у нас получается 259)

s = open('24.txt').readline()
s =s.replace('D', 'D ').replace('A', ' A')
M = []
for x in s.split():
    if 'A' in x and 'D' in x:
        print(x)
        M.append(x)
print(max([len(x) for x in M]))

# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************


# endregion Урок: ******************************************************************


# Василий = [2.1, 5.1, 6.1, 8.1, 12.1, 14.1, 15.1, 16.1, 17.1, 23.1, 24.1]
# КЕГЭ  = []
# на следующем уроке:
