
# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************


# todo Разобраться почему три варианта решения 17, 18, 19
'''
s = open('24.txt').readline()
s = s.replace('B', 'A').replace('C', 'A').replace('9', '8')

while 'AA' in s: s = s.replace('AA', 'A A')
while '88' in s: s = s.replace('88', '8 8')
print(max(len(x) for x in s.split()))
'''

s = open('24.txt').readline().upper()
s = s.replace('TXA', '***').replace('XY', '**').replace('XA', '**')
for a in set(s):
    if a != '*':
        s = s.replace(a, ' ')
print(s)
print(max([len(x) for x in s.split()]))

# endregion Урок: ******************************************************************


# Василий = [2.1, 5.1, 6.1, 8.1, 12.1, 14.1, 15.1, 16.1, 17.1, 23.1, 24.1]
# КЕГЭ  = []
# на следующем уроке:
