# region Домашка: ************************************************************


# endregion Домашка: ************************************************************


# region Урок: ************************************************************



# endregion Урок: ************************************************************


# todo: Василий = [2, 3, 5, 6, 8, 12, 14+, 15, 17, 19-21, 22, 24, 25.1]
# на прошлом уроке: Повторили 22, 18, 15 номера.
# на следующем уроке: Прорешиваем задачи с вопросами. Хочу посмотреть как решаются 16 письменные. И 25 на маски/отрезки, 15 номера на отрезки.
