
# region Домашка: ******************************************************************

# КЕГЭ № 8602 (Уровень: Базовый) (Л. Шастин)
#
# Все шестибуквенные слова, в составе которых могут быть только русские буквы А, Е, К, Н, С
# записаны в алфавитном порядке и пронумерованы начиная с 1. Ниже приведено начало списка.
#
# 1. АААААА
#  2. АААААЕ
#  3. АААААК
#  4. АААААН
#  5. АААААС
#  6. ААААЕА
#
# Под каким номером в списке идёт слово СЕНЕКА?
'''
s = sorted('АЕКНС')
i = 1
for a in s:
    for b in s:
        for c in s:
            for d in s:
                for e in s:
                    for f in s:
                        slovo = a + b + c + d + e + f
                        if slovo == 'СЕНЕКА':
                            print(i)
                        i += 1
'''

# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************



# endregion Урок: ******************************************************************


# todo: Василий = [2.1, 5.1, 8.1, 14.1]
# todo:   КЕГЭ  = []
# на прошлом уроке: Настроили проект скаченый с github. Разобрались в ошибках с 8 номером и прорешали две задачи.
# на следующем уроке:
