# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# Типы данных строка str (string)
'''
s = 'Hello, world!'
print(s)

s1 = 'Hello, '
s2 = 'world!'
print(s1 + s2)  # конкатенация строк (склеивание)

s = '8' * 10
print(s)  # 8888888888 - Строка при умножении на целое число - дублируется
'''


'''
# i  01234
s = 'abcde'

print(s[0], s[1], s[2], s[3], s[4])  # a b c d e
print(s[-5], s[-4], s[-3], s[-2], s[-1])  # a b c d e

print(f'Первый элемент строки s: {s[0]} \n'
      f'Последний элемент строки s: {s[-1]}')
# Первый элемент строки s: a 
# Последний элемент строки s: e
'''

# Срезы строк
'''
# i  01234
s = 'abcde'
print(s[0:3])  # abc
print(s[1:4])  # bcd
print(s[:4])  # abcd
print(s[2:])  # cde
print(s[:])  # abcde - все элементы
print(s[::-1])  # edcba
print(s[::2])  # ace
print(s[1::2])  # bd
'''


# Методы строк
'''
s = 'abcdea'
print(len(s))  # 5 - длина строки (кол-во элементов в строке)
print(s.count('a'))  # 1 - возвращает кол-во вхождений элемента в сроку
print(s.index('a'))  # 0 - возвращает индекс первого вхождения
print(s.rindex('a'))  # 5 - возвращает индекс последнего вхождения
s = s.replace('a', '*')  # заменил все буквы а на *
print(s)  # *bcde*
s = s.replace('*', 'a', 1)  # заменил одну звездочку (слева) на а
print(s)  # abcde*
'''

# endregion Урок: ******************************************************************

# Вика = [2.1, 6.1]
# КЕГЭ  = []
# на следующем уроке:
