# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

'''
# I (бит) = a (шт) * b (Гц) * c (бит) * t (сек)

a1 = 2  # шт каналов
b1 = 32000  # Гц
c1 = 16  # бит
I1 = (30 * 2**23) / 0.6  # 100% файла в битах
t = I1 / (a1 * b1 * c1)  # 409.6 сек

a2 = 4  # шт каналов
b2 = 48000  # Гц
c2 = 24  # бит
I2_old = a2 * b2 * c2 * t  # бит до сжатия (100%)

I2_new = (180 * 2**23)  # бит после сжатия
print(I2_new / (I2_old / 100))  # 80%

# Ответ: сократили на 120%
'''


print(f'{255:b}')  # 11111111
# Маска сети имеет вид: 111111..000
# Адрес сети = IP-адрес узла & Маска сети

# КЕГЭ № 10777 (Уровень: Базовый)
# По заданным IP-адресу узла сети и маске определите адрес сети:
# IP-адрес: 140.37.235.224
# Маска: 255.255.240.0
'''
from ipaddress import *
net = ip_network('140.37.235.224/255.255.240.0', 0)
print(net)  # 140.37.224.0/20
'''

# КЕГЭ № 10778 (Уровень: Базовый)
# Для узла с IP-адресом 163.232.136.60 адрес сети равен 163.232.136.0
# Найдите наибольшее возможное количество единиц в двоичной записи маски подсети.
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'163.232.136.60/{mask}', 0)
    print(net, mask)
    # 163.232.136.0/21 21
    # 163.232.136.0/22 22
    # 163.232.136.0/23 23
    # 163.232.136.0/24 24
    # 163.232.136.0/25 25
    # 163.232.136.0/26 26
'''
# Ответ: 26


# КЕГЭ № 10776 (Уровень: Базовый)
# Для узла с IP-адресом 111.91.200.28 адрес сети равен 111.91.192.0
# Найдите наименьшее возможное количество нулей в двоичной записи маски подсети.
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'111.91.200.28/{mask}', 0)
    print(net, mask, 32-mask)

    # 111.91.192.0/18 18 14
    # 111.91.192.0/19 19 13
    # 111.91.192.0/20 20 12
'''


# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************


# Вика = [1, 2, 3, 4, 6, 7, 8, 10, 11, 12, 13, 14, 15, 16, 18, 19-21, 23, 25]
# КЕГЭ  = [2, 3, 6, 14]
# на следующем уроке:
