# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# Тип 14 №38948
# Значение выражения 4**36 + 3*4**20 + 4**15 + 2*4**7 + 49 записали
# в системе счисления с основанием 16. Сколько разных цифр встречается в этой записи?
'''
x = 4**36 + 3*4**20 + 4**15 + 2*4**7 + 49
print(set(hex(x)[2:]))  # {'8', '3', '1', '0', '4'}
print(len(set(hex(x)[2:])))  # 5

# Вариант 2
x = 4**36 + 3*4**20 + 4**15 + 2*4**7 + 49
M = []
while x > 0:
    M.append(x % 16)
    x //= 16
print(set(M))
'''


# Тип 14 №19065
# Сколько единиц содержится в двоичной записи значения выражения: 4**8 + 2**8 - 8?
'''
x = 4**8 + 2**8 - 8
M = []
while x > 0:
    M.append(x % 2)
    x //= 2
print(M.count(1))
'''
# Ответ: 6

'''
alphabet = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alphabet[:15]:
    A = int(f'97968{x}13', 15)
    B = int(f'7{x}213', 15)
    if (A + B) % 14 == 0:
        print((A + B) // 14)
'''
# 116070624

'''
alphabet = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alphabet[:11]:
    for y in alphabet[:11]:
        A = int(f'{x}341{y}', 11)
        B = int(f'56{x}1{y}', 19)
        if (A + B) % 305 == 0:
            print((A + B) // 305)
'''
# 2778


# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************


# Вика = [1, 2, 3, 4, 6, 7, 8, 11, 12, 14, 15, 16, 18, 19-21, 23, 25]
# КЕГЭ  = [2, 3, 6, 14]
# на следующем уроке:
