
# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# Типы данных переменных
'''
a: int = 5  # int (integer) - целочисленные значения
print(type(a))  # <class 'int'>

b = 5.0  # float (число с плавающей точкой) - вещественные числа (дроби)
print(4/2, type(4/2))  # 2.0 <class 'float'>

c = '5'
print(a * 4, c * 4)  # 20 5555 - строки при умножении на целое число - дублируются
print('Hello,' + ' world!')  # Hello, world! - конкатенация строк (склеивание)

d1 = True  # bool (Boolean) - основы математической логики
d2 = False
print(4 == 10)  # False
print(4 != 10)  # True
print(4 < 10)  # True
print(False + True + True + True)  # 3
'''


# Типы данных коллекций
"""
L = [1, 2, 3]  # list (список)
L = []  # пустой список
L = list()

# - Может хранить неограниченное кол-во элементов разных типов данных
# - Каждый элемент списка имеет порядковый номер - индекс
# - Индексы слева-направо начинаются с 0, а справа-налево начинаются с -1
# - В отличие от кортежей в списках можно изменять элементы через индексы

# i   0    1    2    3    4
L = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1

L[1] = 'weijohtnjreiougthj'
print(L)   # ['a', 'weijohtnjreiougthj', 'c', 'd', 'e']


T = (1, 2, 3)  # tuple (кортеж)
# Все тоже самое, что у списков, только нельзя менять элементы


S = {1, 2, 3, 1, 2, 3}  # set (множество)
print(S)  # {1, 2, 3} - не может содержать копии элементов

D = {'один': 'one', 'два': 'two', 'три': 'three'}  # dict (словарь)
# Элементы словаря состоят из двух частей: ключ и значение
# Доступ к значению элемента словаря осуществляется через его ключ
print(D['один'])  # one
D['один'] = 1
print(D)  # {'один': 1, 'два': 'two', 'три': 'three'}
print(D.keys())  # dict_keys(['один', 'два', 'три'])
print(D.values())  # dict_values([1, 'two', 'three'])
print(D.items())  # dict_items([('один', 1), ('два', 'two'), ('три', 'three')])
for key, value in D.items():
    print(f'ключ: {key}, значение: {value}')
    # ключ: один, значение: 1
    # ключ: два, значение: two
    # ключ: три, значение: three

students = {1117001188: ('ArtemGelyaOlegLiza.py', '22:00-00:00', 9600, 'Геля', 8, 0, 'Tuesday')}
"""

'''
M = [1, 2.0, 'fregret', True, 1+1, 7/2, 'wer' + 'erw', 4 < 10, [1, 2, 3], (1, 2, 3), {1, 2, 3}, {'один': 'one', 'два': 'two', 'три': 'three'}]
for x in M:
    print(x, type(x))
    # 1 <class 'int'>
    # 2.0 <class 'float'>
    # fregret <class 'str'>
    # True <class 'bool'>
    # 2 <class 'int'>
    # 3.5 <class 'float'>
    # wererw <class 'str'>
    # True <class 'bool'>
    # [1, 2, 3] <class 'list'>
    # (1, 2, 3) <class 'tuple'>
    # {1, 2, 3} <class 'set'>
    # {'один': 'one', 'два': 'two', 'три': 'three'} <class 'dict'>
'''


# Конвертация типов данных
'''
a = 5
print(a, type(a))  # 5 <class 'int'>

a = str(a)
print(a, type(a))  # 5 <class 'str'>
# ValueError: invalid literal for int() with base 10: '5.0'

a = float(a)
print(a, type(a))  # 5.0 <class 'float'>

a = int(a)
print(a, type(a))  # 5 <class 'int'>


A = [1, 2, 3, 1, 2, 3] 
print(A, type(A))  # [1, 2, 3, 1, 2, 3] <class 'list'>

A = tuple(A)
print(A, type(A))  # (1, 2, 3, 1, 2, 3) <class 'tuple'>

A = set(A)
print(A, type(A))  # {1, 2, 3} <class 'set'>

A = list(A)
print(A, type(A))  # [1, 2, 3] <class 'list'>
'''


# Ввод данных с клавиатуры
'''
s = input('Введите строку: ')
print(s, type(s))  # 31234567 <class 'str'>

x = int(input('Введите число: '))
print(x, type(x))  # 31234567 <class 'int'>
'''


# Пример использования f-строки
# "Сегодня облачно, а температура 24 градуса!"
'''
weather = 'облачно'
temperature = 24
print("Сегодня ", weather, ", а температура ", temperature, " градуса!")
print("Сегодня " + weather + ", а температура " + str(temperature) + " градуса!")
print("Сегодня {}, а температура {} градуса!".format(weather, temperature))
print(f"Сегодня {weather}, а температура {temperature} градуса!")
'''

'''
text = (
    "🧮 Полный прайс лист:\n"
    "▪️ Первое пробное занятие — БЕСПЛАТНО (60 минут занятие).\n\n"
    "🙋‍♂️Индивидуальные занятия:\n"
    "▪️ Разовое занятие — 2200 руб (60 минут занятие).\n"
    "▪️ 4 занятия — 8000 руб (~9% скидка, 60 минут занятие).\n"
    "▪️ 8 занятий — 14400 руб (~18% скидка, 60 минут занятие).\n\n"
    "👨‍💻👩‍💻🧑‍💻Групповые занятия (в группе 4 человека):\n"
    "▪️ 2 занятия — 2700 руб (90 минут занятие).\n"
    "▪️ 4 занятия — 5100 руб (~5% скидка, 90 минут занятие).\n"
    "▪️ 8 занятий — 9600 руб (~11% скидка, 90 минут занятие).\n\n"
    "🔖Чек предоставляется по факту каждой оплаты через НПД (Самозанятый)."
)
print(text)
'''

# Базовая арифметика
'''
a = 7
b = 2

print(f'{a} + {b} = {a + b} \n'
      f'{a} - {b} = {a - b} \n'
      f'{a} * {b} = {a * b}')

print()  # в каждом print() есть один "\n"
"""
for x in range(0, 10):
    print(x, end='\n')

for x in range(0, 10):
    print(x, end=' ')   # 0 1 2 3 4 5 6 7 8 9 
"""


print(f'{a} / {b} = {a / b} \n'  # 3.5 - вещественное деление (результат всегда float)
      f'{a} // {b} = {a // b} \n'  # 3 - целочисленное деление (только целая часть) 
      f'{a} % {b} = {a % b}')  # 1 - остаток от деления (в виде обыкновенной дроби)

print(127 // 10)  # 12
print(127 % 10)  # 7
print(-127 % 10)  # 3

print()


print(f'Возведем число {a} в степень {b}: {a} ** {b} = {a**b}')
# Возведем число 7 в степень 2: 7 ** 2 = 49

print(f'Возьмем квадратный корень от числа 16: 16 ** (1/2) = {16 ** (1/2)}')
# Возьмем квадратный корень от числа 16: 16 ** (1/2) = 4.0

print(f'Возьмем кубический корень от числа 27: 27 ** (1/3) = {27 ** (1/3)}')
# Возьмем кубический корень от числа 27: 27 ** (1/3) = 3.0
'''

# Список библиотек, которые мы будем использовать на экзамене
'''
import useful  # - это моя самописная библиотека
print(useful.orel_or_reshka())
'''
"""
import fnmatch  # для решения 25 номера
import itertools  # для решения 8 и может пригодиться: 12, 9, 17, 24, 25
import sys  # для решения 16 номера
import turtle  # для решения 6 номера
import ipaddress  # для решения 13 номера

import math
import string
print(string.punctuation)  # !"#$%&'()*+,-./:;<=>?@[\]^_`{|}~
"""

# Способы взаимодействия с библиотеками:
"""
import math
print(math.sqrt(16))  # 4.0

import math as m
print(m.sqrt(16))  # 4.0

from math import sqrt, lcm
print(sqrt(16))  # 4.0

from math import *
print(sqrt(16))  # 4.0
print(lcm(4, 24))  # 24

# Можно пользоваться подсказками
print(sqrt.__doc__)   # Return the square root of x.

print(help(sqrt)) 
# Help on built-in function sqrt in module math:
# 
# sqrt(x, /)
#     Return the square root of x.
# 
# None
"""

# Или навести курсор на функцию и нажать ctrl + B

# endregion Урок: **********************************************************


# Михаил = []
# КЕГЭ  = []
# на следующем уроке:
