
# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************





# endregion Урок: ******************************************************************


# todo: Василий = [2, 5, 8, 12, 14+], на следующем уроке: Добиваем 12 номера и 8 номера. Разбираем 6 номер с turtle. Разбираем теорию функций и 16 номер.