
# region Домашка: ******************************************************************




# endregion Домашка: ******************************************************************



# region Урок: ******************************************************************



# endregion Урок: ******************************************************************


# todo: Владек = [2, 3, 5, 8, 12, 14+, 15, 16, 17, 19-21, 22, 23, 25.2]
# на прошлом уроке: Повторили 19-21 номера на две кучи и разобрли 3 номер через функцию ВПР.
# на следующем уроке: