# region Домашка: ***************************************************************


# endregion Домашка: ************************************************************


# region Урок: ******************************************************************

# Задание 16
# Алгоритм вычисления значения функции F(n),
# где n – натуральное число, задан следующими соотношениями:
# F(n) = 1 при n = 1;
# F(n) = n × F(n − 1), если n > 1.
# Чему равно значение выражения (F(2024) − F(2023)) / F(2022)?
'''
import sys
sys.setrecursionlimit(10000)

def F(n):
    if n == 1:
        return 1
    if n > 1:
        return n * F(n-1)

print( (F(2024) - F(2023)) / F(2022) )

# [Previous line repeated 997 more times]
# RecursionError: maximum recursion depth exceeded
'''
# Ответ: 4092529


# КЕГЭ № 12248 ЕГКР 16.12.23 (Уровень: Базовый)
# Алгоритм вычисления значения функции F(n),
# где n – натуральное число, задан следующими соотношениями:
#
#  F(n)=1 при n≤3;
#  F(n)=(n+3)×F(n−2), если n>3.
#
# Чему равно значение выражения F(2028)/F(2024)?
'''
import sys
sys.setrecursionlimit(10000)

def F(n):
    if n <= 3:
        return 1
    if n > 3:
        return (n+3) * F(n-2)

print(F(2028) / F(2024))

# Письменно:
# F(2028) = 2031 * F(2026)
# F(2026) = 2029 * F(2024) / F(2024)
print(2031 * 2029)
'''
# Ответ: 4120899


# КЕГЭ № 4739 (Уровень: Средний) 🌶
#
# (А. Куканова) Алгоритм вычисления значения функции F(n),
# где n – натуральное число, задан следующими соотношениями:
#
# F(n) = n − 10 000 при n > 10 000;
# F(n) = F(n+1) + F(n+2) если 1 ≤ n ≤ 10 000.

# F(12 345) × (F(10) − F(12)) / F(11) + F(10 101)?
'''
# F(10) = F(11) + F(12)
# (F(11) + F(12) − F(12)) / F(11)
# F(11) / F(11) -> 1
# F(12345) × 1 + F(10101)

def F(n):
    if n > 10000:
        return n - 10000
    if 1 <= n <= 10000:
        return F(n+1) + F(n+2)

print(F(12345) + F(10101))
'''


# КЕГЭ № 8561 (Уровень: Базовый)
# (В. Рыбальченко) Алгоритм вычисления функций F(n) и G(n), где n – целое число, задан следующими соотношениями:
#
#  F(n) = n, при n ≤ 1;
#  F(n) = F(n–1) + F(n–2) + 1, при n > 1 и кратном трем;
#  F(n) = G(n–3), при n > 1 и не кратном трем;

#  G(n) = n, при n > 100;
#  G(n) = G(n + 2) + 1, при n ≤ 100;
#
# Определите значение выражения F(15)+F(12).
'''
def F(n):
    if n <= 1:
        return n
    if n > 1 and n % 3 == 0:
        return F(n-1) + F(n-2) + 1
    if n > 1 and n % 3 != 0:
        return G(n-3)


def G(n):
    if n > 100:
       return n
    if n <= 100:
        return G(n + 2) + 1

print(F(15) + F(12))
'''


# № 10718 (Уровень: Средний)
# Алгоритм вычисления значения функции
# F(n), где n – натуральное число, задан следующими соотношениями:
# F(n)=2 при n<3;
# F(n)=2×F(n−2)−F(n−1)+2, если n>2 и при этом n чётно;
# F(n)=2×F(n−1)+F(n−2)−2, если n>2 и при этом n нечётно.
#
# Чему равно значение функции F(170)?
'''
from functools import *

@lru_cache(None)
def F(n):
    if n < 3:
        return 2
    if n > 2 and n % 2 == 0:
        return 2 * F(n-2) - F(n-1) + 2
    if n > 2 and n % 2 != 0:
        return 2 * F(n-1) + F(n-2) - 2

print(F(170))
'''
# Ответ: 3596910688800

'''
x = 2*729**2014 + 2*243**2016 - 2 * 81**2018 + 2 * 27 ** 2020 - 2*9**2022 - 2024
M = []
while x > 0:
    M.append(x % 27)
    x //= 27
print(len([a for a in M if a > 9]))
'''
# Ответ: 2687

'''
def F(a, b):
    if a > b:
        return 0
    elif a == b:
        return 1
    else:
        return F(a+1, b) + F(a+2, b) + F(a*2, b)

print(F(4, 11) * F(11, 13) * F(13, 15))
'''

'''
from fnmatch import *
for x in range(1917, 10**10, 1917):
    if fnmatch(str(x), '3?12?14*5'):
        print(x, x // 1917)
'''
# Ответ:
# 351261495 183235
# 3212614035 1675855
# 3412614645 1780185
# 3712414275 1936575
# 3912414885 2040905
'''
s = open('24.txt').readline()
s = s.replace('R', 'Q').replace('W', 'Q')
s = s.replace('2', '1').replace('4', '1')
while 'QQ' in s or '11' in s:
    s = s.replace('11', '1 1').replace('QQ', 'Q Q')
print(max([len(x) for x in s.split()]))
'''
# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************


# Марго = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 14, 15, 16, 17, 19-21, 22, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:
