
# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# f-сроки
"""
weather = 'облачно'
temperature = int(input('Введите температуру: '))
# "Сегодня облачно, а температура 24 градуса!"
print("Сегодня", weather, ", а температура ", temperature, " градуса!")
print("Сегодня " + weather + ", а температура " + str(temperature) + " градуса!")
# TypeError: can only concatenate str (not "int") to str
print("Сегодня {}, а температура {} градуса!".format(weather, temperature))
print(f"Сегодня {weather}, а температура {temperature} градуса!")
"""

# Базовая арифметика
'''
a = 7
b = 2
print(f'{a} + {b} = {a+b} \n'  # \n - переход на новую строку в консоли
      f'{a} - {b} = {a-b} \n'
      f'{a} * {b} = {a * b}')

print()  # в пустом принте есть символ '\n' - переход на новую строку

print(f'{a} / {b} = {a/b} - вещественное деление (результат такого деления всегда float) \n'  
      f'{a} // {b} = {a//b} - только целая часть от деления (без округлений) \n'
      f'{a} % {b} = {a % b} - остаток от деления (от обыкновенной дроби) ')
# Проверки из разряда: Кратное ли число? Четное ли число? Делится ли число?

print()

x = int(input('x: '))
if x % 2 == 0:
    print('Четное ')
else:
    print('Нечетное ')

print()

for x in range(10):
    print(x, end=' ')
print()

print()
'''

'''
import math
print(math.sqrt(16))    # взятие квадратного корня

print(f'Возведем число 7 в степень 2: 7 ** 2 = {7**2} \n'
      f'Взять квадратный корень от числа 16: 16 ** (1/2) = {16**(1/2)} \n'
      f'Взять кубический корень от числа 27: 27 ** (1/3) = {27 ** (1/3)}')

import useful
print(useful.Who_Is_Name())
'''

# Список библиотек, которые пригодятся на экзамене
'''
import math
import string
print(string.punctuation)  # !"#$%&'()*+,-./:;<=>?@[\]^_`{|}~

import turtle  # для решения 6-го номера
import ipaddress  # для решения новго 13-го номера 
import itertools  # Может пригодиться в 8, 9, 24, 25 номерах
import fnmatch  # для решения 25-го номера с масками
import sys  # для решения 16-го номера 
'''

# Как пользоваться библиотеками
'''
import math
print(math.sqrt(16))

import math as m
print(m.sqrt(16))

from math import sqrt, factorial
print(sqrt(16))

from math import *
print(sqrt(16))
print(pow(7, 2))

# Навести курсор и нажать сочетание клавиш ctrl + B
'''

# endregion Урок: ******************************************************************


# todo: Марго = []
# todo:   КЕГЭ  = []
# на прошлом уроке:
# на следующем уроке:
