# region Домашка: ***************************************************************


# endregion Домашка: ************************************************************


# region Урок: ******************************************************************

from itertools import permutations

graph = 'АБ БА АВ ВА ВБ БВ ВД ДВ ДБ БД БИ ИБ ДИ ИД ЕД ДЕ ИЕ ЕИ ЖИ ИЖ ЕЖ ЖЕ ГЕ ЕГ ГЖ ЖГ ГА АГ АЖ ЖА'
table = '13 14 15 18 26 27 28 31 34 35 37 41 43 46 47 51 53 58 62 64 67 68 72 73 74 76 81 82 85 86'

for per in permutations('АБИЖВГЕД'):
    new_table = table
    for i in range(1, 8 + 1):
        new_table = new_table.replace(str(i), per[i - 1])
    if set(new_table.split()) == set(graph.split()):
        print('1 2 3 4 5 6 7 8')
        print(*per)

# 1 2 3 4 5 6 7 8
# Б Г Д И В Ж Е А
# 1 2 3 4 5 6 7 8
# Ж В Е И Г Б Д А

# endregion Урок: ******************************************************************


# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************


# Марго = [2, 5, 6, 7, 8, 9, 11, 12, 14, 15, 16, 17, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:
