
# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************


# endregion Урок: ******************************************************************


# todo: Всеволод = [2, 3, 5.1, 8, 9, 12, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# todo: Тип 18 № 48466 (разобрать)
# на прошлом уроке: Повторяем теорию игр. Разбирали 18 номера всех типов.
# на следующем уроке:
