# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************
'''
summ = 0
while True:
    x = int(input())
    if x < 0:
        break
    summ += x
print(summ)
'''

# endregion Урок: ******************************************************************

# Лика = []
# КЕГЭ  = []
# на следующем уроке: Продолжаем разбирать 8-ой номер
