# region Домашка: ******************************************************************

'''
a = int(input())
b = int(input())
c = int(input())
print(a + b + c)
'''

'''
n = len(set(list([1, 2, 3])))
print(n)
'''
# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# Условные операторы (ветвление): if, elif, else
'''
x = -5
y = 2

if x > 0 and y > 0:  # if (если) - главное условие
    print('Первая четверть')
elif x < 0 and y > 0:
    print('Вторая четверть')
elif x < 0 and y < 0:
    print('Третья четверть')
elif x > 0 and y < 0:  # elif (иначе если) - любое промежуточное условие
    print('Четвертая четверть')
else:  # else (иначе) - противопостовление всем предыдущим условиям
    print('Лежит на осях')
'''

# Каскадлые условные операторы
'''
x = int(input('x: '))
y = int(input('y: '))

if x > 0:
    if y > 0:  # x > 0 and y > 0
        print('Первая четверть')
    else:  # x > 0 and y <= 0
        print('Четвертая четверть')
else:
    if y > 0:  # x <= y and y > 0
        print('Вторая четверть')
    else:  # x <= 0 and y <= 0
        print('Третья четверть')
'''


# Год является високосным, если его номер кратен 4, но не кратен 100, или если он кратен 400.

year = int(input())

if year % 4 == 0:
    print('Кратен')
elif year % 4 != 0:   # != - не равно
    print('Не кратен')

# Логические связки: and. or, not

a = 6
b = -7
if a > 0 and b > 0:
    print('ДА 1')
if a > 0 or b > 0:
    print('Да 2')

# endregion Урок: ******************************************************************


# todo: Артур = []
# todo: КЕГЭ  = []
# на прошлом уроке:
# на следующем уроке:
