# region Домашка: ******************************************************************
'''
def task(start, end):
    if start > end:
        return 0
    if start == end:
        return 1
    if start < end:
        return task(start + 2, end) + task(start * 2, end)


print(task(1, 24) * task(24, 50))
'''
# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************


# Тип 15 №18087
# Для какого наименьшего целого неотрицательного числа A выражение
# (y + 2x < A) ∨ (x > 15) ∨ (y > 30)
# тождественно истинно при всех вещественных значениях x и y?
'''
# Вариант 1
def F(x, y, A):
    return (y + 2*x < A) or (x > 15) or (y > 30)


for A in range(0, 1000):
    flag = True
    for x in range(0, 100):
        for y in range(0, 100):
            # if F(x, y, A) == False:
            if not F(x, y, A):
                flag = False
                break
    #if flag == True:
    if flag:
        print(A)
        break


# Вариант 2
for a in range(0, 300):
    k = 0
    for x in range(0, 300):
        for y in range(0, 300):
            if (y + 2*x < a) or (x > 15) or (y > 30):
                k += 1
    if k == 90_000:
        print(a)
        break


# Вариант 3
def F(x, y, A):
    return (y + 2*x < A) or (x > 15) or (y > 30)


for A in range(0, 1000):
    if all(F(x, y, A) for x in range(0, 100) for y in range(0, 100)):
        print(A)
        break


# Вариант 4
R = []
def F(x, y, A):
    return (y + 2*x < A) or (x > 15) or (y > 30)


for A in range(0, 1000):
    if all(F(x, y, A) for x in range(0, 100) for y in range(0, 100)):
        R.append(A)
print(min(R))


# Вариант 5
print(min([A for A in range(0, 1000) if all(((y + 2*x < A) or (x > 15) or (y > 30)) for x in range(0, 100) for y in range(0, 100))]))
'''
# Ответ: 61


# Тип 15 №33760
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».
# Для какого наибольшего натурального числа А формула
# ДЕЛ(120, A) ∧ (ДЕЛ(x, 36) → (¬ДЕЛ(x, А) → ¬ДЕЛ(x, 45)))
# тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной x)?
'''
def F(x, A):
    return (120 % A == 0) and ((x % 36 == 0) <= ((x % A != 0) <= (x % 45 != 0)))


R = []
for A in range(1, 1000):
    if all(F(x, A) for x in range(1, 10000)):
        R.append(A)
print(max(R))
'''


# Тип 15 №34542
# На числовой прямой даны два отрезка: P = [1, 39] и Q = [23, 58].
# Какова наибольшая возможная длина интервала A, что логическое выражение
#
# ((x ∈ P) → ¬(x ∈ Q)) → ¬(x ∈ А)
#
# тождественно истинно, то есть принимает значение 1 при любом значении переменной х.
'''
def F(x, a1, a2):
    P = 1 <= x <= 39
    Q = 23 <= x <= 58
    A = a1 <= x <= a2
    return (P <= (not Q)) <= (not A)


R = []
M = [x / 4 for x in range(0*4, 60*4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2-a1)
print(max(R))
'''
# Ответ: 16


# Тип 15 №8666
# На числовой прямой даны два отрезка: P = [25; 50] и Q = [32; 47].
# Укажите наибольшую возможную длину промежутка A, для которого формула
# (¬ (x  A) → (x  P)) → ((x  A) → (x  Q))
# тождественно истинна, то есть принимает значение 1 при любом значении переменной х.
'''
def F(x, a1, a2):
    P = 25 <= x <= 50
    Q = 32 <= x <= 47
    A = a1 <= x <= a2
    return ((not A) <= P) <= (A <= Q)


R = []
M = [x / 4 for x in range(20*4, 60*4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2-a1)
print(max(R))
'''
# Ответ: 15


# Тип 15№40990
# На числовой прямой даны два отрезка: P=[19;84] и Q=[4;51].
# Укажите наименьшую возможную длину такого отрезка A, для которого формула
# (x∈P)→(¬(x∈Q)→¬((x∈P)∧¬(x∈A)))
# тождественно истинна (т.е. принимает значение 1 при любом значении переменной х).
'''
def F(x, a1, a2):
    P = 19 <= x <= 84
    Q = 4 <= x <= 51
    A = a1 <= x <= a2
    return P <= ((not Q) <= (not(P and (not A))))


R = []
M = [x / 4 for x in range(0*4, 90*4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2-a1)
print(min(R))
'''
# Ответ: 32.75 -> 32.8 -> 32.9 -> 33


# endregion Урок: ******************************************************************


# Артур = [2.1. 5.1, 6.1, 8.1, 12.1, 14.1, 15.1, 16.1, 23.1]
# КЕГЭ  = []
# на следующем уроке:
