# region Домашка: ******************************************************************
'''
s = input()
n = int(input())
for x in range(n):
    print(s)
'''
# endregion Домашка: ******************************************************************


# region Урок: ******************************************************************

# Разбираем 2 номер егэ по информатике

# Тип 2 №33081
# Логическая функция F задаётся выражением (x ∨ ¬z) ∧ (x ≡ ¬w) ∧ (x → y).
'''
print('x y z w F')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                F = (x or (not z)) and (x == (not w)) and (x <= y)
                if F:
                    print(x, y, z, w, int(F))
'''


# Тип 2 №36015
# Логическая функция F задаётся выражением (x → y) ∨ ¬(w → z).

print('x y z w F')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                F = (x <= y) or (not(w <= z))
                if not F:
                    print(x, y, z, w, int(F))

# endregion Урок: ******************************************************************


# todo: Артур = [2.1]
# todo: КЕГЭ  = []
# на прошлом уроке:
# на следующем уроке:
